DraenorTreasures = LibStub("AceAddon-3.0"):NewAddon("DraenorTreasures", "AceBucket-3.0", "AceConsole-3.0", "AceEvent-3.0", "AceTimer-3.0")
local HandyNotes = LibStub("AceAddon-3.0"):GetAddon("HandyNotes", true)
if not HandyNotes then return end
local iconDefaults = {
default = "Interface\\Icons\\TRADE_ARCHAEOLOGY_CHESTOFTINYGLASSANIMALS",
unknown = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\chest_normal_daily.tga",
hundredrare = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconBlue.tga",
rare = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIcon.tga",
swprare = "Interface\\Icons\\Trade_Archaeology_Fossil_SnailShell",
shrine = "Interface\\Icons\\inv_misc_statue_02",
glider = "Interface\\Icons\\inv_feather_04",
rocket = "Interface\\Icons\\ability_mount_rocketmount",
}
local PlayerFaction, _ = UnitFactionGroup("player")
DraenorTreasures.nodes = { }
local nodes = DraenorTreasures.nodes
local isTomTomloaded = false
local isDBMloaded = false

if (IsAddOnLoaded("TomTom")) then 
	isTomTomloaded = true
end
if (IsAddOnLoaded("DBM-Core")) then 
	isDBMloaded = true
end

nodes["ShadowmoonValleyDR"] = {
--SMV Treasures
[54924501]={ "35581", "炼金师的包裹", "草药", "", "default", "SMVTreasures","109124"},
[52834837]={ "35584", "先祖巨斧", "i519 力量双手斧", "", "default", "SMVTreasures","113560"},
[41422798]={ "33869", "装甲雷象獠牙", "i518 饰品 护甲加成+使用后精通", "", "default", "SMVTreasures","108902"},
[37784435]={ "33584", "阿库伯的灰烬", "休息奖励经验值的消耗品", "", "default", "SMVTreasures","113531"},
[49313760]={ "33867", "占星家的盒子", "玩具", "", "default", "SMVTreasures","109739"},
[36774142]={ "33046", "爱人的祭品", "趣味物品 - 副手", "", "default", "SMVTreasures","113547"},
[37182313]={ "33613", "冒泡的大锅", "i516 法术副手", "在一个山洞内; 入口在东北 38, 22.3 附近", "default", "SMVTreasures","108945"},
[84564478]={ "33885", "渡鸦女皇的货物", "要塞物资", "", "default", "SMVTreasures","824"},
[33453961]={ "33569", "雕饰饮水角", "可重复使用的法力药水", "", "default", "SMVTreasures","113545"},
[61706790]={ "34743", "托瓦斯的水晶之刃", "垃圾物品", "与物件互动的是三个银叶古树; 杀掉他们后才可以拾取物品", "default", "SMVTreasures","111636"},
[20383065]={ "33575", "恶魔宝箱", "i550 智力项链", "", "default", "SMVTreasures","108904"},
[29853748]={ "36879", "尘封的宝箱", "随机绿装和金币", "在巨石拱门上; 从其他的拱门跳跃到那里，起始点在西边的悬崖边上", "default", "SMVTreasures","824"},
[51753549]={ "33037", "带夹层的罐子", "金钱", "", "default", "SMVTreasures","824"},
[26530568]={ "34174", "神奇鱼", "要塞物资", "", "default", "SMVTreasures","824"},
[34394623]={ "33891", "巨型月柳球果", "i522 魔杖", "", "default", "SMVTreasures","108901"},
[48724753]={ "35798", "发光的洞穴蘑菇", "草药", "", "default", "SMVTreasures","109127"},
[38484308]={ "33614", "格瑞卡的坛子", "i528 饰品 急速+力量触发", "", "default", "SMVTreasures","113408"},
[47154603]={ "33564", "挂起的背包", "i518 敏捷/智力 皮甲手套", "", "default", "SMVTreasures","108900"},
[42106130]={ "33041", "钢铁部落货箱", "要塞物资", "", "default", "SMVTreasures","824"},
[37515925]={ "33567", "钢铁部落贡品", "饰品 溅射+使用后伤害", "", "default", "SMVTreasures","108903"},
[57924531]={ "33568", "卡利鸟蛋", "25 要塞物资", "", "default", "SMVTreasures","113271"},
[58882193]={ "35603", "米卡尔的箱子", "垃圾物品", "", "default", "SMVTreasures","113215"},
[52882486]={ "37254", "长满蘑菇的宝箱", "25 要塞物资", "", "default", "SMVTreasures","113388"},
[66963349]={ "36507", "兽人骷髅", "i526 力量戒指", "", "default", "SMVTreasures","116875"},
[43756062]={ "33611", "和平祭礼 1", "垃圾物品", "", "default", "SMVTreasures","107650"},
[45226049]={ "33610", "和平祭礼 2", "垃圾物品", "", "default", "SMVTreasures","107650"},
[44486357]={ "33384", "和平祭礼 3", "垃圾物品", "", "default", "SMVTreasures","107650"},
[44495914]={ "33612", "和平祭礼 4", "垃圾物品", "", "default", "SMVTreasures","107650"},
[31223905]={ "33886", "罗诺克的物品", "i522 力量披风", "", "default", "SMVTreasures","109081"},
[22893385]={ "33572", "腐朽的篮子", "垃圾物品", "在血棘洞穴内", "default", "SMVTreasures","113373"},
[36684455]={ "33573", "罗沃的匕首", "i520 敏捷匕首", "", "default", "SMVTreasures","113378"},
[67058418]={ "33565", "带鳞片的双头飞龙蛋", "垃圾物品", "!!! 等级100区域 !!!", "default", "SMVTreasures","44722"},
[45822458]={ "33570", "影月流亡者宝箱", "25 要塞物资", "在一个山洞内 出现的放逐者下面", "default", "SMVTreasures","113388"},
[29994536]={ "35919", "影月祭祀匕首", "i524 法术匕首", "", "default", "SMVTreasures","113563"},
[28233924]={ "33883", "影月宝藏", "要塞物资", "", "default", "SMVTreasures","824"},
[27050248]={ "35280", "失窃的宝藏", "要塞物资", "", "default", "SMVTreasures","824"},
[55821997]={ "35600", "奇异孢子", "宠物", "在巨型蘑菇顶上", "default", "SMVTreasures","118104"},
[37192601]={ "35677", "沉没的渔船", "鱼类", "", "default", "SMVTreasures","118414"},
[28820720]={ "35279", "沉没的宝箱", "要塞物资", "", "default", "SMVTreasures","824"},
[55297487]={ "35580", "沼泽荧光虫蜂巢", "玩具", "", "default", "SMVTreasures","117550"},
[35854087]={ "33540", "乌兹克的小玩意儿", "i525 敏捷/智力 皮甲鞋", "", "default", "SMVTreasures","113546"},
[34214353]={ "33866", "威玛的草药包", "草药", "", "default", "SMVTreasures","109124"},
[51147912]={ "33574", "守备官宝箱", "玩具", "!!! 等级100区域 !!!", "default", "SMVTreasures","113375"},
[39208391]={ "33566", "进水的宝箱", "i520 力量拳套+要塞物资", "", "default", "SMVTreasures","113372"},
--SMVRares
[37203640]={ "33061", "阿莫卡瓦", "i516 敏捷/智力 锁甲胸", "在非常大区域内盘旋", "rare", "SMVRares","109060"},
[50807880]={ "37356", "阿夸利亚", "i620 智力戒指", "!!! 等级101 !!!", "hundredrare", "SMVHundred","119387"},
[68208480]={ "37410", "雪崩", "i620 力量单手锤", "!!! 等级100 !!!", "hundredrare", "SMVHundred","119400"},
[52801680]={ "35731", "巴鲁恩", "无增益的重复性食物", "", "rare", "SMVRares","113540"},
[43807740]={ "33383", "荆棘大王菲里", "i620 敏捷法杖", "!!! 等级100 !!!", "hundredrare", "SMVHundred","117551"},
[48604360]={ "33064", "暗影余孽", "i516 智力拳套", "在洞穴内; 杀掉邪教徒使其可以被攻击", "rare", "SMVRares","109075"},
[41008300]={ "35448", "黑暗大师高维德", "i525 智力法杖+龙虾人召唤", "", "rare", "SMVRares","113548"},
[49604200]={ "35555", "暗爪", "i520 敏捷披风", "", "rare", "SMVRares","113541"},
[46007160]={ "37351", "戴米多斯", "i620 敏捷/力量 坦克项链+宠物+成就", "!!! 等级102 !!! 从索克雷萨高地到他的平台，从东边的石头上跳过去", "hundredrare", "SMVHundred","119377"},
[67806380]={ "35688", "爱娜瓦拉", "i523 智力项链", "与她的尸体进行交互后与其刷新的灵魂作战", "rare", "SMVRares","113556"},
[61606180]={ "35725", "灵光", "i526 敏捷/智力 皮甲腿", "", "rare", "SMVRares","113557"},
[37404880]={ "35558", "催眠魔蛙", "玩具", "", "rare", "SMVRares","113631"},
[57404840]={ "35909", "伊沙塔尔", "i520 敏捷/智力 锁甲鞋", "", "rare", "SMVRares","113571"},
[40804440]={ "33043", "戮喉", "i516 敏捷匕首", "", "rare", "SMVRares","109078"},
[32203500]={ "33039", "虚空先知库塔格", "i516 敏捷/智力 锁甲手套", "", "rare", "SMVRares","109061"},
[48007760]={ "37355", "魔女泰普特莎", "i620 敏捷/智力 皮甲鞋", "!!! 等级101 !!!", "hundredrare", "SMVHundred","119360"},
[37601460]={ "33055", "读叶者库里", "i518 饰品 全能+治疗触发", "", "rare", "SMVRares","108907"},
[44802080]={ "35906", "“疯王”斯波隆", "i519 敏捷法杖", "", "rare", "SMVRares","113561"},
[29605080]={ "37357", "马尔高什·护影", "i620 敏捷/智力 锁甲头盔", "!!! 等级100 !!!", "hundredrare", "SMVHundred","119369"},
[51807920]={ "37353", "军士长米格拉", "i620 敏捷/智力 锁甲手套", "!!! 等级101 !!!", "hundredrare", "SMVHundred","119368"},
[38607020]={ "35523", "莫尔瓦·屈魂者", "i520 单手 法术锤", "", "rare", "SMVRares","113559"},
[44005760]={ "33642", "主母奥姆拉", "i522 饰品 智力 +精通触发", "杀掉邪教徒使其可以被攻击", "rare", "SMVRares","113527"},
[58408680]={ "37409", "纳吉达", "i620 敏捷/智力 皮甲肩", "!!! 等级100 !!! 在山洞内 - 入口在 59,89", "hundredrare", "SMVHundred","119364"},
[50207240]={ "37352", "军需官赫沙克", "i620 力量/智力 板甲腿", "!!! 等级101 !!!", "hundredrare", "SMVHundred","119382"},
[48602260]={ "35553", "莱沃什", "重复性缓落物品", "", "rare", "SMVRares","113542"},
[53005060]={ "34068", "岩蹄", "i516 力量盾", "", "rare", "SMVRares","109077"},
[48208100]={ "37354", "暗影语者纳尔", "i620 法术匕首", "!!! 等级101 !!!", "hundredrare", "SMVHundred","119396"},
[61005520]={ "35732", "辛利", "400% 有CD的陆地坐骑", "在大范围游荡 - 时常躲避和消失", "rare", "SMVRares","113543"},
[61408880]={ "37411", "银喉", "i620 力量双手剑", "!!! 等级100 !!!", "hundredrare", "SMVHundred","119411"},
[27604360]={ "36880", "斯尼维尔", "i519 布甲腿", "", "rare", "SMVRares","118734"},
[21602100]={ "33640", "维洛斯", "i516 智力戒指", "", "rare", "SMVRares","108906"},
[54607060]={ "33643", "毒影", "i516 敏捷/智力 皮甲鞋", "", "rare", "SMVRares","108957"},
[31905720]={ "37359", "虚空掠夺者乌奈", "i620 敏捷单手斧", "!!! 等级100 !!!", "hundredrare", "SMVHundred","119392"},
[32604140]={ "35847", "虚空先知卡鲁格", "i516 布甲腰带", "杀掉邪教徒使其可以被攻击", "rare", "SMVRares","109074"},
[48806640]={ "33389", "伊格德尔", "玩具", "", "rare", "SMVRares","113570"},
[29405150]={ "37357", "马尔高什·护影", "i620 敏捷/智力 锁甲头盔", "!!! 等级100 !!!", "hundredrare", "SMVHundred","119369"},
}
nodes["FrostfireRidge"] = {
--FFRTreasures
[23172495]={ "33916", "竞技场大师的作战号角", "玩具", "在竞技场上面的看台上", "default", "FFRTreasures","108735"},
[24242712]={ "33501", "观众的箱子", "酒精饮料", "在石拱门顶上; 从附近的塔上跳过去", "default", "FFRTreasures","63293"},
[61904254]={ "33511", "吞噬者布罗克", "i516 智力盾", "喂给它10个食人魔后掉落", "default", "FFRTreasures","112110"},
[42161930]={ "34520", "燃烧的珍珠", "i525 饰品 溅射+精通触发", "!!! 等级100区域 !!!", "default", "FFRTreasures","120341"},
[50161870]={ "33531", "笨拙的库拉戈莫蛮兵", "i516 敏捷/智力 锁甲头盔", "!!! 等级100区域 !!! 在低悬崖边上", "default", "FFRTreasures","112096"},
[42663175]={ "33940", "攀岩者的宝箱", "i516 敏捷/智力 锁甲鞋", "从墙上的长矛跳过去到达那里", "default", "FFRTreasures","112187"},
[40902010]={ "34473", "特使的袋子", "垃圾物品", "!!! 等级100区域 !!!", "default", "FFRTreasures","110536"},
[43665562]={ "34841", "被遗忘的补给品", "要塞物资", "", "default", "FFRTreasures","824"},
[24184860]={ "34507", "冰封的霜狼战斧", "i516 法强斧", "在一个山洞内", "default", "FFRTreasures","110689"},
[57175216]={ "34476", "冰封的兽人骷髅 ", "i516 饰品精通+宠物触发", "", "default", "FFRTreasures","111554"},
[25522050]={ "34648", "啃过的骨头", "i516 敏捷匕首", "", "default", "FFRTreasures","111415"},
[66712640]={ "33948", "鬣蜥人残渣", "25 要塞物资", "!!! 等级100区域 !!! 在山顶的洞上，向上的路径开始为69.3, 24", "default", "FFRTreasures","111543"},
[68124586]={ "33947", "肃霜宝箱", "要塞物资", "", "default", "FFRTreasures","824"},
[56727186]={ "36863", "钢铁部落军需品", "要塞物资", "", "default", "FFRTreasures","824"},
[68906910]={ "33017", "钢铁部落补给品", "要塞物资", "", "default", "FFRTreasures","824"},
[21890963]={ "33926", "环礁池塘", "玩具", "需要钓鱼", "default", "FFRTreasures","108739"},
[19211202]={ "34642", "幸运硬币", "趣味物品 - 硬币", "卖价25金", "default", "FFRTreasures","111408"},
[38303782]={ "33502", "黑曜石岩画", "5%休息经验的消耗品", "在山上; 上山斜路在39, 42.5", "default", "FFRTreasures","112087"},
[28296663]={ "34470", "白鬼鱼贩", "鱼", "", "default", "FFRTreasures","111666"},
[21685076]={ "34931", "一袋白鬼战利品", "要塞物资", "在洞里", "default", "FFRTreasures","824"},
[37265914]={ "34967", "抢来的战利品", "要塞物资", "在塔顶上", "default", "FFRTreasures","824"},
[09834533]={ "34641", "密封的罐子", "趣味物品 - 箴言", "", "default", "FFRTreasures","111407"},
[27654280]={ "33500", "奴隶的宝贝", "酒精饮料", "", "default", "FFRTreasures","43696"},
[23971291]={ "34647", "积雪覆盖的保险箱", "金钱", "", "default", "FFRTreasures","824"},
[16124972]={ "33942", "遗弃的补给品", "要塞物资", "", "default", "FFRTreasures","824"},
[64722573]={ "33946", "生存专家的宝箱", "要塞物资", "", "default", "FFRTreasures","824"},
[34192348]={ "32803", "雷神储备点", "i516 敏捷/力量长柄", "", "default", "FFRTreasures","107658"},
[64406586]={ "33505", "震动的蛋", "宠物", "", "default", "FFRTreasures","112107"},
[54843545]={ "33525", "年轻的兽人旅行者", "未知", "您需要收集部份的年轻的女兽人和年轻的兽人旅行者来完成这个", "default", "FFRTreasures","112206"},
[63401470]={ "33525", "年轻的女兽人", "未知", "您需要收集部份的年轻的女兽人和年轻的兽人旅行者来完成这个", "default", "FFRTreasures","112206"},
[39661718]={ "33532", "库拉戈莫的箱子", "原始之灵+埃匹希斯水晶", "!!! 等级100区域 !!!", "default", "FFRTreasures","120945"},
[45365034]={ "33011", "白发苍苍的霜狼老兵", "i516 耐力饰品+2%击杀治疗", "击败兽人进攻后与 NPC 交谈从尘封宝箱获得拾取", "default", "FFRTreasures","106899"},
--FFRRares
[88605740]={ "37525", "“屠夫”阿奥克斯", "i620 敏捷/智力 皮甲腰带", "!!! 等级100 !!!", "hundredrare", "FFRHundred","119365"},
[27405000]={ "34497", "无息", "玩具", "", "rare", "FFRRares","111476"},
[66403140]={ "33843", "巢母里戈艾克", "i516 饰品 智力+溅射触发", "", "rare", "FFRRares","111533"},
[34002320]={ "32941", "深峡冰母蜥蜴", "25 要塞物资", "", "rare", "FFRRares","101436"},
[41206820]={ "34843", "冻牙", "i513 敏捷/智力 皮甲腿", "", "rare", "FFRRares","111953"},
[40404700]={ "33014", "烬喉", "i516 法术匕首", "", "rare", "FFRRares","111490"},
[25405500]={ "34129", "哀恸者冰蹄", "i516 智力项链", "", "rare", "FFRRares","112066"},
[54606940]={ "34131", "冷牙", "i516 敏捷/力量 单手剑", "", "rare", "FFRRares","111484"},
[67407820]={ "34477", "飓风之怒", "i516 布甲肩", "", "rare", "FFRRares","112086"},
[71404680]={ "33504", "炎怒巨灵", "i516 副手", "", "rare", "FFRRares","107661"},
[54602220]={ "32918", "巨人屠夫库尔", "i516 饰品 全能+敏捷触发", "", "rare", "FFRRares","111530"},
[70003600]={ "37562", "熔岩鲸吸者高戈阿克", "i620 力量拳套", "!!! 等级100 !!!", "hundredrare", "FFRHundred","111545"},
[38001400]={ "37388", "高里瓦克斯", "i620 智力布甲手腕", "", "hundredrare", "FFRHundred","119358"},
[38606300]={ "34865", "劫掠者古图什", "i513 敏捷/智力 锁甲腿", "", "rare", "FFRRares","112077"},
[50305260]={ "34825", "古鲁克", "i513 饰品 急速+暴击", "", "rare", "FFRRares","111948"},
[47005520]={ "34839", "戈伦", "i513 力量披风", "", "rare", "FFRRares","111955"},
[68801940]={ "37382", "霜降", "i620 智力/精神 戒指", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119415"},
[58603420]={ "34130", "狩猎大师康恩", "要塞物资", "", "rare", "FFRRares","824"},
[48202340]={ "37386", "刺颚", "i620 法术盾", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119390"},
[61602640]={ "34708", "攀岩者杰希尔", "i516 敏捷/智力 皮甲鞋", "", "rare", "FFRRares","112078"},
[43002100]={ "37387", "莫托玛", "i620 布甲肩", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119356"},
[70002700]={ "37381", "鬣蜥人主母", "i620 力量项链", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119376"},
[83604720]={ "37402", "“绞肉机”奥戈姆", "i620 敏捷/智力 皮甲手腕", "!!! 等级100 !!!", "hundredrare", "FFRHundred","119366"},
[36803400]={ "33938", "指挥官穆尔格", "i516 布甲腿", "", "rare", "FFRRares","111576"},
[86604880]={ "37401", "拉戈尔·逐流", "i620 敏捷/智力 皮甲胸", "!!! 等级100 !!!", "hundredrare", "FFRHundred","119359"},
[76406340]={ "34132", "斥候高斯克", "i516 敏捷/智力 皮甲胸", "", "rare", "FFRRares","112094"},
[45001500]={ "37385", "食尸者暴牙", "i620 敏捷/智力 皮甲头", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119362"},
[38201600]={ "37383", "高拉摩尔之子", "i620 法术锤", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119399"},
[26803160]={ "34133", "打击者", "i516 力量 双手锤", "", "rare", "FFRRares","111475"},
[72203300]={ "37361", "白骨爬行者", "i620 智力/力量 板甲胸", "!!! 等级101 !!!", "hundredrare", "FFRHundred","111534"},
[43600940]={ "37384", "托格洛斯", "i620 副手", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119379"},
[40601240]={ "34522", "冰封者乌戈洛克", "i620 智力法杖", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119409"},
[72402420]={ "37378", "沃卡尔", "100要塞物资", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119416"},
[70603900]={ "37379", "古老的沃罗克", "100要塞物资", "!!! 等级101 !!!", "hundredrare", "FFRHundred","119416"},
[40402780]={ "34559", "疤脸雅佳", "i516 敏捷/智力 皮甲腰带", "在低悬崖边上", "rare", "FFRRares","111477"},
[84604680]={ "37403", "震地者霍拉", "i620 敏捷项链", "!!! 等级100 !!!", "hundredrare", "FFRHundred","119374"},
[66602540]={ "37380", "胆小的吉布利特", "i620 敏捷披风+趣味物品", "!!! 等级101 !!! 在山顶的洞上，向上的路径开始为69.3, 24", "hundredrare", "FFRHundred","119349"},
[86804500]={ "37404", "折铁者卡加", "i620 敏捷/智力 锁甲腰带", "!!! 等级100 !!!", "hundredrare", "FFRHundred","119372"},
}
nodes["BladespireFortress"] = {
[26613949]={ "35370", "多罗戈的秘密宝箱", "金钱+垃圾物品", "刀塔堡垒二层, 户外", "default", "FFRBF","113189"},
[26403642]={ "35367", "戈尔索格的私人金库", "酒精饮料", "刀塔堡垒顶层, 靠近王座", "default", "FFRBF","118108"},
[26603520]={ "35347", "食人魔战利品", "要塞资源", "刀塔堡垒二层", "default", "FFRBF","824"},
[28293440]={ "35368", "食人魔战利品", "金钱", "刀塔堡垒一层; 要爬上箱子才能拿到", "default", "FFRBF",""},
[27783917]={ "35369", "食人魔战利品", "金钱", "刀塔堡垒一层; 要爬上箱子才能拿到", "default", "FFRBF",""},
[27603382]={ "35371", "食人魔战利品", "金钱", "刀塔堡垒二层; 要爬上箱子才能拿到", "default", "FFRBF",""},
[27173763]={ "35373", "食人魔战利品", "金钱", "刀塔堡垒二层; 要爬上箱子才能拿到", "default", "FFRBF",""},
[28093409]={ "35567", "食人魔战利品", "要塞资源", "刀塔堡垒二层", "default", "FFRBF","824"},
[30723869]={ "35568", "食人魔战利品", "要塞资源", "刀塔堡垒二层", "default", "FFRBF","824"},
[30083927]={ "35569", "食人魔战利品", "要塞资源", "刀塔堡垒二层", "default", "FFRBF","824"},
[27283876]={ "35570", "食人魔战利品", "金钱", "刀塔堡垒一层", "default", "FFRBF",""},
}
nodes["Gorgrond"] = {
--GorgrondTreasures
[41735297]={ "36506", "波尔卡的袋子", "i538 法术法杖", "", "default", "GorgrondTreasures","118702"},
[42368341]={ "36625", "被遗弃的包裹", "金钱+随机绿装", "", "default", "GorgrondTreasures",""},
[41827802]={ "36658", "永晨补给篮", "随机绿装", "", "default", "GorgrondTreasures",""},
[40367660]={ "36621", "探险家罐子", "50 要塞物资", "", "default", "GorgrondTreasures","118710"},
[40047223]={ "36170", "稀有腿骨", "垃圾物品", "", "default", "GorgrondTreasures","118715"},
[46104999]={ "36651", "可收获的珍贵水晶", "要塞物资", "", "default", "GorgrondTreasures","824"},
[42584685]={ "35056", "长角的颅骨", "要塞物资", "", "default", "GorgrondTreasures","824"},
[43694248]={ "36618", "钢铁补给箱", "要塞物资", "", "default", "GorgrondTreasures","824"},
[44207427]={ "35709", "嘲颅包裹", "要塞物资", "在树上", "default", "GorgrondTreasures","824"},
[43109290]={ "34241", "奥卡巴的包裹", "垃圾物品", "", "default", "GorgrondTreasures","118227"},
[52516696]={ "36509", "奇怪的颅骨", "i535 副手", "", "default", "GorgrondTreasures","118717"},
[46244295]={ "36521", "石化的双头飞龙蛋", "垃圾物品", "", "default", "GorgrondTreasures","118707"},
[43957055]={ "36118", "一堆碎石", "随机绿装", "", "default", "GorgrondTreasures",""},
[53127449]={ "36654", "巴里克·碎矿的遗骸", "垃圾物品", "", "default", "GorgrondTreasures","118714"},
[57845597]={ "36605", "波迪尔·深岩的遗物", "垃圾物品", "", "default", "GorgrondTreasures","118703"},
[39036805]={ "36631", "萨莎的秘密包裹", "金钱+随机绿装", "", "default", "GorgrondTreasures",""},
[44954262]={ "36634", "狙击手的强弩", "i539 弩", "", "default", "GorgrondTreasures","118713"},
[48129337]={ "36604", "隐秘的急救背包", "金钱+随机绿装", "", "default", "GorgrondTreasures",""},
[52977995]={ "34940", "样子古怪的匕首", "i537 敏捷匕首", "", "default", "GorgrondTreasures","118718"},
[57086530]={ "37249", "奇怪的孢子", "宠物", "在悬崖顶伸长出的蘑菇上", "default", "GorgrondTreasures","118106"},
[45694972]={ "36610", "日灼之矛", "垃圾物品", "", "default", "GorgrondTreasures","118708"},
[59296379]={ "36628", "守备官的战锤", "i539 力量 双手锤", "", "default", "GorgrondTreasures","118712"},
[48944731]={ "36203", "热乎乎的鬣蜥人蛋", "7天后会孵出玩具的蛋", "", "default", "GorgrondTreasures","118705"},
[49284363]={ "36596", "武器架", "100 要塞物资", "", "default", "GorgrondTreasures","107645"},
--GorgrondRares
[58604120]={ "37371", "阿卡利", "i620 敏捷/智力 皮甲 手套", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119361"},
[40007900]={ "35335", "巴肖克", "玩具", "", "rare", "GorgrondRares","118222"},
[69204460]={ "37369", "巴斯滕+努尔塔+瓦斯提尔", "玩具+i620 布甲腰带", "!!! 等级100 !!! 3个在一起", "hundredrare", "GorgrondHundred","119357"},
[39407460]={ "36597", "贝索拉", "i532 敏捷/智力 锁甲肩", "", "rare", "GorgrondRares","118232"},
[46003360]={ "37368", "剑圣罗戈尔", "i620 布甲鞋", "!!! 等级101 !!!", "hundredrare", "GorgrondHundred","119228"},
[53404460]={ "35503", "炽燃的焦皮", "i536 双手 法术锤", "", "rare", "GorgrondRares","118212"},
[48202100]={ "37362", "背叛者达兹戈", "i620 力量长柄", "!!! 等级101 !!!", "hundredrare", "GorgrondHundred","119224"},
[57603580]={ "37370", "深渊之根", "i620 敏捷长柄", "!!! 等级100 !!! 2个刷新点其中之一", "hundredrare", "GorgrondHundred","119406"},
[72604040]={ "37370", "深渊之根", "i620 敏捷长柄", "!!! 等级100 !!! 2个刷新点其中之一", "hundredrare", "GorgrondHundred","119406"},
[50002380]={ "37366", "可恨的杜普", "i620 敏捷皮甲腰带", "!!! 等级101 !!!", "hundredrare", "GorgrondHundred","119225"},
[72803580]={ "37373", "纵火者格拉什", "i620 力量/智力 板甲手", "!!! 等级100 !!! 2个刷新点其中之一", "hundredrare", "GorgrondHundred","119381"},
[58003640]={ "37373", "纵火者格拉什", "i620 力量/智力 板甲手", "!!! 等级100 !!! 2个刷新点其中之一", "hundredrare", "GorgrondHundred","119381"},
[57406860]={ "36387", "石化的岩木", "玩具", "", "rare", "GorgrondRares","118221"},
[41804540]={ "36391", "“蓝焰”戈尔高", "i534 饰品 全能+智力触发", "", "rare", "GorgrondRares","118230"},
[46205080]={ "36204", "格鲁特", "i534 饰品 敏捷+溅射触发", "", "rare", "GorgrondRares","118229"},
[52805360]={ "37413", "瘤颚", "i620 智力拳套", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119397"},
[46804320]={ "36186", "狡猾的戈尔多克", "i534 力量 单手锤", "", "rare", "GorgrondRares","118210"},
[59604300]={ "37375", "林地守卫者雅尔", "i620 智力 披风", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119414"},
[52207020]={ "35908", "虫巢女王斯基卡", "i534 法强斧", "", "rare", "GorgrondRares","118209"},
[47002380]={ "37365", "豪格", "i620 敏捷/智力 锁甲胸", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119229"},
[55004660]={ "37377", "猎人巴尔拉", "i620 弓", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119412"},
[47603060]={ "37367", "发明家布拉莫", "i620 敏捷枪+趣味物品", "!!! 等级101 !!!", "hundredrare", "GorgrondHundred","119226"},
[52205580]={ "37412", "软泥怪大王", "i620 力量披风", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119351"},
[50605320]={ "36178", "曼达科尔", "宠物", "", "rare", "GorgrondRares","118709"},
[49003380]={ "37363", "疯狂的麦德加", "i620 智力项链", "!!! 等级101 !!!", "hundredrare", "GorgrondHundred","119230"},
[61803930]={ "37376", "莫伽玛戈", "i620 力量盾", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119391"},
[47002580]={ "37364", "莫尔戈·凯恩", "i620 力量/智力 板甲头", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119227"},
[53407820]={ "34726", "蛛后阿兰妮艾", "i534 敏捷匕首", "", "rare", "GorgrondRares","118208"},
[37608140]={ "36600", "里普塔尔", "i539 法术匕首", "", "rare", "GorgrondRares","118231"},
[47804140]={ "36393", "洛克尔", "i539 饰品 力量+暴击触发", "", "rare", "GorgrondRares","118211"},
[54207240]={ "36837", "怒蹄", "i537  敏捷/力量 双手锤", "", "rare", "GorgrondRares","118228"},
[38206620]={ "35910", "践踏者克罗格", "食人魔酿造工具组", "每7天可以产出酒精饮料", "rare", "GorgrondRares","118224"},
[40205960]={ "36394", "硫磺之怒", "玩具", "", "rare", "GorgrondRares","114227"},
[44609220]={ "36656", "日爪", "i533 敏捷拳套", "", "rare", "GorgrondRares","118223"},
[59903200]={ "37374", "迅捷黑色掠夺者", "i620 敏捷/智力 锁甲鞋", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119367"},
[64006180]={ "36794", "塞尔多斯", "i540 敏捷/智力 皮甲鞋", "", "rare", "GorgrondRares","118213"},
[76004200]={ "37405", "提丰", "埃匹希斯水晶", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","823"},
[63803160]={ "37372", "维诺拉斯克", "i620 敏捷匕首", "!!! 等级100 !!!", "hundredrare", "GorgrondHundred","119395"},
}
nodes["Talador"] = {
--TaladorTreasures
[36509610]={ "34182", "阿尔克的传家宝", "i557 弩", "", "default", "TaladorTreasures","117567"},
[62083238]={ "34236", "艾米瑟尔水晶", "100 要塞物资", "", "default", "TaladorTreasures","116131"},
[81843494]={ "34260", "阿鲁纳矿车", "矿物", "", "default", "TaladorTreasures","109118"},
[62414797]={ "34252", "一桶鱼", "鱼", "", "default", "TaladorTreasures","110506"},
[33297680]={ "34259", "噬骨遗物", "要塞物资", "", "default", "TaladorTreasures","824"},
[37607490]={ "34148", "噬骨长矛", "i566 敏捷/智力 锁甲手套", "从蛇鞭的尸体上找到长矛", "default", "TaladorTreasures","112371"},
[73525137]={ "34471", "闪亮硬币", "i560 饰品 全能+护甲加成触发", "", "default", "TaladorTreasures","116127"},
[70100700]={ "36937", "火刃宝箱", "埃匹希斯水晶", "", "default", "TaladorTreasures","823"},
[77044996]={ "34248", "烧焦的长剑", "i563 力量双手剑", "", "default", "TaladorTreasures","116116"},
[66508694]={ "34239", "古怪的逝网蛛卵", "玩具", "", "default", "TaladorTreasures","117569"},
[58901200]={ "33933", "德塞普提亚的冒烟靴子", "玩具", "", "default", "TaladorTreasures","108743"},
[55256671]={ "34253", "德莱尼武器", "100 要塞物资", "", "default", "TaladorTreasures","116118"},
[35419656]={ "34249", "农夫的宝贝", "要塞物资", "", "default", "TaladorTreasures","824"},
[57362866]={ "34238", "工头的午餐盒", "重复性 食物/饮料", "", "default", "TaladorTreasures","116120"},
[64587920]={ "34251", "铁盒子", "i554 力量单手锤", "", "default", "TaladorTreasures","117571"},
[75003600]={ "33649", "钢铁斥候", "要塞资源", "", "default", "TaladorTreasures","824"},
[57207540]={ "34134", "伊萨莉宝箱", "i564 敏捷项链", "", "default", "TaladorTreasures","117563"},
[65471137]={ "34233", "一大壶陈年黑铁佳酿", "酒精饮料", "", "default", "TaladorTreasures","117568"},
[75684140]={ "34261", "克鲁的物品  ", "金钱", "", "default", "TaladorTreasures",""},
[53972769]={ "34290", "凯特娅的宝箱", "宠物", "", "default", "TaladorTreasures","116402"},
[38191242]={ "34258", "海洋之光", "金钱", "", "default", "TaladorTreasures","824"},
[68805620]={ "34101", "圣光使者", "垃圾物品", "", "default", "TaladorTreasures","109192"},
[52562954]={ "34235", "微光贝壳", "i557 智力项链", "", "default", "TaladorTreasures","116132"},
[78211471]={ "34263", "纯净水晶尘", "i554 敏捷戒指", "", "default", "TaladorTreasures","117572"},
[75784472]={ "34250", "阿鲁纳遗物", "垃圾物品", "", "default", "TaladorTreasures","116128"},
[46969174]={ "34256", "泰尔莫遗物", "垃圾物品", "", "default", "TaladorTreasures","116128"},
[64901330]={ "34232", "鲁克的工具盒", "+4 钓鱼线", "", "default", "TaladorTreasures","116117"},
[65968513]={ "34276", "生锈宝箱", "随机绿装", "", "default", "TaladorTreasures",""},
[39505520]={ "34254", "缚魂者的圣物箱", "i558 智力戒指", "", "default", "TaladorTreasures","117570"},
[74602930]={ "35162", "恐爪鸟巢穴 1", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[39307770]={ "35162", "恐爪鸟巢穴 10", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[73503070]={ "35162", "恐爪鸟巢穴 2", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[74303400]={ "35162", "恐爪鸟巢穴 3", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[72803560]={ "35162", "恐爪鸟巢穴 4", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[72403700]={ "35162", "恐爪鸟巢穴 5", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[70903550]={ "35162", "恐爪鸟巢穴 6", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[70803200]={ "35162", "恐爪鸟巢穴 7", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[54105630]={ "35162", "恐爪鸟巢穴 8", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[39807670]={ "35162", "恐爪鸟巢穴 9", "宠物", "只有一个恐爪巢可以拾取", "default", "TaladorTreasures","112699"},
[38338450]={ "34257", "安葛洛什宝藏", "趣味物品 - 投掷的岩石", "", "default", "TaladorTreasures","116119"},
[65448860]={ "34255", "结网的囊袋", "金钱", "", "default", "TaladorTreasures",""},
[40608950]={ "34140", "尤里的礼物", "要塞物资", "", "default", "TaladorTreasures","824"},
[28397419]={ "36829", "古树的礼物", "i563 智力戒指", "在洞中; 旋转全部三个石像使它们面背对中间时将刷新宝箱", "default", "TaladorTreasures","118686"},
[39304172]={ "34207", "闪光之池", "要塞资源+钓鱼物品", "需要钓鱼", "default", "TaladorTreasures","112623"},
--TaladorRares
[46603520]={ "37338", "索克雷萨的化身", "i620 副手", "!!! 等级101 !!!", "hundredrare", "TaladorHundred","119378"},
[44003800]={ "37339", "炮兵古戈克", "i620 弩", "!!! 等级101 !!!", "hundredrare", "TaladorHundred","119413"},
[37607040]={ "34165", "考尔·裂肉者", "i558 力量单手锤", "", "rare", "TaladorRares","116123"},
[68201580]={ "34142", "格鲁姆博士", "趣味物品 - 臭气弹", "", "rare", "TaladorRares","112499"},
[34205700]={ "34221", "摩摩尔的回响", "玩具", "", "rare", "TaladorRares","113670"},
[50808380]={ "35018", "邪皮", "i554 法术盾", "", "rare", "TaladorRares","112373"},
[50203520]={ "37341", "魔火扈从", "i620 敏捷戒指", "!!! 等级101 !!!", "hundredrare", "TaladorHundred","119386"},
[46005500]={ "34145", "疯狂的魔像", "i563 敏捷/力量 单手剑 或 i563 法术匕首", "", "rare", "TaladorRares","113287"},
[67408060]={ "34929", "加纳迪安", "i558 饰品 敏捷+精通触发", "", "rare", "TaladorRares","116075"},
[31806380]={ "34189", "闪翼", "有使用次数限制的短期加速增益", "", "rare", "TaladorRares","116113"},
[22207400]={ "36919", "格布戈尔", "i588 敏捷/智力 皮甲腰带", "点击躁动的箱子", "rare", "TaladorRares",""},
[47603900]={ "37340", "古托尔", "i620 法术剑", "!!! 等级101 !!!", "hundredrare", "TaladorHundred","119402"},
[48002500]={ "37312", "吞天者哈坤", "i620 力量单手剑", "!!! 等级100 !!!", "hundredrare", "TaladorHundred","119403"},
[62004600]={ "34185", "槌牙", "i558 敏捷/智力 锁甲胸", "", "rare", "TaladorRares","116124"},
[78005040]={ "34167", "雌鸟哈米", "i556 智力披风", "", "rare", "TaladorRares","112369"},
[56606360]={ "35219", "自负的卡拉佐斯/戈尔佐玛/Sikthiss", "玩具", "其中之一-只能拾取一次", "rare", "TaladorRares","116122"},
[66808540]={ "34498", "克里奇克斯", "玩具", "", "rare", "TaladorRares","116125"},
[37203760]={ "37348", "库尔洛什·灭牙", "i620 敏捷匕首", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119394"},
[33803780]={ "37346", "魔女德姆拉什", "i620 布甲胸", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119352"},
[37802140]={ "37342", "燃烧军团先锋", "i620 力量/智力 板甲手腕", "!!! 等级101 !!!", "hundredrare", "TaladorHundred","119385"},
[49009200]={ "34208", "洛玛格·碎颚", "i558 力量项链", "", "rare", "TaladorRares","116070"},
[30502640]={ "37345", "领主考利纳克", "i620 力量戒指", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119388"},
[39004960]={ "37349", "罪孽魔女", "i620 布甲手套", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119353"},
[86403040]={ "34859", "诺洛什", "i558 饰品 全能+智力触发", "", "rare", "TaladorRares","116077"},
[31404750]={ "37344", "观察者奥鲁莫", "i620 智力项链+宠物", "!!! 等级102 !!! 需要5个玩家点击物品召唤", "hundredrare", "TaladorHundred","119375"},
[59505960]={ "34196", "拉坎", "i563 敏捷拳套", "", "rare", "TaladorRares","116112"},
[41004200]={ "37347", "暗焰恐惧行者", "i620 力量单手斧", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119393"},
[41805940]={ "34671", "沙兹尔", "i554 敏捷/智力 皮甲鞋", "", "rare", "TaladorRares","112370"},
[67703550]={ "36858", "钢牙", "i559 敏捷长柄", "", "rare", "TaladorRares","117562"},
[46002740]={ "37337", "战略家安克尔、大魔导师泰卡尔、缚魂者奈拉娜", "i620 智力披风", "!!! 等级101 !!! 3个在一起", "hundredrare", "TaladorHundred","119350"},
[59008800]={ "34171", "塔拉多寡妇蛛", "i565 敏捷剑", "", "rare", "TaladorRares","116126"},
[53909100]={ "34668", "鸦爪祭司佐卡拉", "i560 布甲头盔", "", "rare", "TaladorRares","116110"},
[63802070]={ "34945", "低阶监工血鬃", "i554 力量戒指", "别杀死他的宠物", "rare", "TaladorRares","112475"},
[36804100]={ "37350", "警戒者帕索斯", "i620 智力/力量 板甲肩", "!!! 等级102 !!!", "hundredrare", "TaladorHundred","119383"},
[69603340]={ "34205", "游荡的守备官", "i554 力量单手剑", "", "rare", "TaladorRares","112261"},
[38001460]={ "37343", "毁灭者埃索瑟尔", "i620 敏捷/智力 锁甲肩+趣味物品", "!!! 等级100 !!!", "hundredrare", "TaladorHundred","119371"},
[53802580]={ "34135", "焚化者亚兹拉", "i554 敏捷/智力 锁甲手腕", "", "rare", "TaladorRares","112263"},
}
nodes["SpiresOfArak"] = {
--SoATreasures
[40595497]={ "36458", "被遗弃的采矿锄", "i578 力量单手斧", "在德拉诺允许更加快速的采矿", "default", "SoATreasures","116913"},
[36195446]={ "36462", "海军上将泰勒的保险箱", "要塞物资", "需要一把旧钥匙", "default", "SoATreasures","824"},
[37705640]={ "36462", "旧钥匙", "海军上将泰勒资源宝箱钥匙", "", "default", "SoATreasures","116020"},
[49203721]={ "36445", "刺客的长矛", "i580 敏捷长柄", "", "default", "SoATreasures","116835"},
[55539086]={ "36367", "战争捐赠物资", "金钱", "", "default", "SoATreasures",""},
[68428898]={ "36453", "折币的报酬", "要塞物资", "", "default", "SoATreasures","824"},
[36585791]={ "36418", "厄菲阿尔的黑暗魔典", "i579 副手", "", "default", "SoATreasures","116914"},
[50502210]={ "36246", "龟裂的太阳石", "垃圾物品", "", "default", "SoATreasures","116919"},
[37154750]={ "36420", "要塞补给品", "要塞物资", "", "default", "SoATreasures","824"},
[41855042]={ "36451", "要塞工匠的锤子", "i580 力量单手锤", "", "default", "SoATreasures","116918"},
[48604450]={ "36386", "安苏之赐", "i585 弩", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118237"},
[57007900]={ "36390", "安苏之赐", "i585 法术单手剑", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118241"},
[46954044]={ "36389", "安苏之赐", "i585 敏捷/力量长柄", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118238"},
[52031958]={ "36392", "安苏之赐", "i585 法术法杖", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118239"},
[42402670]={ "36388", "安苏之赐", "i585 魔杖", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118242"},
[61105537]={ "36381", "安苏之赐", "i585 敏捷/力量 单手剑", "饮用一个暗影视觉药剂 靠近圣物盒以获取安苏之赐", "default", "SoATreasures","118240"},
[50332579]={ "36444", "钢铁部落炸药", "垃圾物品", "", "default", "SoATreasures","118691"},
[50782874]={ "36247", "失落的草药袋", "草药", "", "default", "SoATreasures","109124"},
[47773612]={ "36411", "失落的戒指", "i578 智力戒指", "", "default", "SoATreasures","116911"},
[52474280]={ "36416", "遗失的卷轴", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[42691832]={ "36244", "遗失的卷轴", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[63586737]={ "36454", "神秘菌菇", "草药", "", "default", "SoATreasures","109127"},
[60808780]={ "35481", "尼兹克西的箱子", "要塞资源", "点击尼兹克西逃生舱在60.9 88.0并跟随他到岸边", "default", "SoATreasures","824"},
[53315552]={ "36403", "鸦母的供品 1", "奖励5%休息经验值的消耗品", "", "default", "SoATreasures","118267"},
[48355261]={ "36405", "鸦母的供品 2", "奖励5%休息经验值的消耗品", "", "default", "SoATreasures","118267"},
[48905470]={ "36406", "鸦母的供品 3", "奖励5%休息经验值的消耗品", "", "default", "SoATreasures","118267"},
[51886465]={ "36407", "鸦母的供品 4", "奖励5%休息经验值的消耗品", "", "default", "SoATreasures","118267"},
[60976387]={ "36410", "鸦母的供品 5", "奖励5%休息经验值的消耗品", "", "default", "SoATreasures","118267"},
[58706024]={ "36340", "独眼魔战利品", "垃圾物品", "", "default", "SoATreasures","116921"},
[36283934]={ "36402", "兽人信号号角", "i577 饰品 溅射+力量触发", "", "default", "SoATreasures","120337"},
[36821716]={ "36243", "流亡者财物 1", "金钱+随机绿装", "", "default", "SoATreasures",""},
[42172168]={ "36447", "流亡者财物 2", "金钱+随机绿装", "", "default", "SoATreasures",""},
[46903406]={ "36446", "流亡者袋子", "金钱+随机绿装", "", "default", "SoATreasures",""},
[42961637]={ "36245", "流亡者圣物 1", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[45964415]={ "36354", "流亡者圣物 2", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[43162726]={ "36355", "流亡者圣物 3", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[67373983]={ "36356", "流亡者圣物 4", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[60215391]={ "36359", "流亡者圣物 5", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[51894892]={ "36360", "流亡者圣物 6", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[37375056]={ "36657", "鲁比的洛洛", "i581 力量项链", "你需要在地窖中从厨师拿到鲁比饼干来喂狗", "default", "SoATreasures","116887"},
[44331204]={ "36377", "鲁克玛的影像", "垃圾物品", "", "default", "SoATreasures","118693"},
[59179064]={ "36366", "水手扎祖克的高纯度朗姆酒  ", "酒精饮料", "", "default", "SoATreasures","116917"},
[68333893]={ "36375", "塞泰克神像", "垃圾物品", "", "default", "SoATreasures","118692"},
[71644859]={ "36450", "塞泰克仪式用酒", "治疗药水+酒精饮料", "", "default", "SoATreasures","109223"},
[56232881]={ "36362", "碎手宝箱", "要塞物资", "", "default", "SoATreasures","824"},
[47923065]={ "36361", "碎手保险箱", "真钢宝箱", "", "default", "SoATreasures","116920"},
[60868461]={ "36456", "切割机零件", "要塞物资", "", "default", "SoATreasures","824"},
[56294531]={ "36433", "走私的埃匹希斯遗物", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[59638134]={ "36365", "自动喷洒机5000XT型", "要塞物资", "", "default", "SoATreasures","824"},
[34142751]={ "36421", "烈日宝箱 1", "要塞物资", "", "default", "SoATreasures","824"},
[33292727]={ "36422", "烈日宝箱 2", "考古碎片", "要求考古学和可能一点跳跃", "default", "SoAArchaeology",""},
[54353255]={ "36364", "毒牙毒液", "100 要塞物资", "", "default", "SoATreasures","118695"},
[66475653]={ "36455", "浸水的背包", "金钱+随机绿装", "", "default", "SoATreasures",""},
[57802220]={ "36374", "安苏的雕像", "垃圾物品", "", "default", "SoATreasures","118694"},
--SoARares
[58208460]={ "36291", "贝蒂斯·爆篮", "i583 枪", "", "rare", "SoARares","116907"},
[46802300]={ "35599", "剑舞者艾瑞克斯", "垃圾物品", "", "rare", "SoARares","116839"},
[64006480]={ "36283", "凋零之光", "i586 敏捷/智力 皮甲肩", "", "rare", "SoARares","118205"},
[46402860]={ "36267", "杜卡斯·钢喉", "i586 敏捷/智力 锁甲鞋", "", "rare", "SoARares","118198"},
[69005400]={ "37406", "艾奇迪纳", "未知", "!!! 等级100 !!!", "hundredrare", "SoAHundred",""},
[54803960]={ "36297", "脓花", "i584 副手", "", "rare", "SoARares","118200"},
[25202420]={ "36943", "加兹", "要塞物资", "", "rare", "SoARares","824"},
[74404280]={ "37390", "暴食巨人", "i620 魔杖", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119404"},
[33005900]={ "36305", "贪鳍", "垃圾物品", "", "rare", "SoARares","116836"},
[59201500]={ "36887", "独居的白鬃", "i582 布甲头盔", "", "rare", "SoARares","118279"},
[56609460]={ "36306", "孢子吞噬者贾斯卡", "i589 饰品 急速+智力触发", "", "rare", "SoARares","118202"},
[62603740]={ "36268", "浴血的卡洛斯", "i588 布甲胸", "", "rare", "SoARares","118735"},
[53208900]={ "36396", "穆塔芬", "i589 力量双手锤", "", "rare", "SoARares","118206"},
[36405240]={ "36129", "纳斯·杜柏林", "i578 敏捷/力量长柄", "", "rare", "SoARares","116837"},
[66005500]={ "36288", "复仇者奥斯奇拉", "i589 敏捷匕首", "", "rare", "SoARares","118204"},
[59403740]={ "36279", "毒药大师波塔斯克", "i583 饰品 溅射+使用后伤害", "", "rare", "SoARares","118199"},
[38402780]={ "36470", "烂菌", "宠物", "", "rare", "SoARares","118107"},
[69004880]={ "36276", "桑里卡斯", "i589 敏捷/智力 皮甲胸", "", "rare", "SoARares","118203"},
[71203380]={ "37392", "暗影巨人", "i620 敏捷/智力 皮甲腿", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119363"},
[52003540]={ "36478", "影皮", "i579 法术盾", "", "rare", "SoARares","118201"},
[51800720]={ "37394", "日光放大器", "i620 智力长柄", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119407"},
[33402200]={ "36265", "岩怒", "i577 敏捷/智力 锁甲腿", "", "rare", "SoARares","116858"},
[58604520]={ "36298", "碎棘", "i578 敏捷单手剑", "", "rare", "SoARares","116855"},
[52805480]={ "36472", "沼叶", "i582 法术法杖", "", "rare", "SoARares","116857"},
[54606320]={ "36278", "断爪者", "i578 敏捷项链", "", "rare", "SoARares","116838"},
[57407400]={ "36254", "破碎者特斯卡", "i578 智力项链", "", "rare", "SoARares","116852"},
[71702010]={ "37360", "无形梦魇怪", "i620 敏捷/智力 锁甲手腕", "!!! 等级100 !!! 位于虚空传送门界面内", "hundredrare", "SoAHundred","119373"},
[71404500]={ "37393", "吉加哨兵", "i620 敏捷单手剑", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119401"},
[70402380]={ "37361", "拆解者基诺斯", "i620 布甲头盔", "!!! 等级100 !!! 位于虚空传送门界面内; 需要3名玩家点击符文石召唤", "hundredrare", "SoAHundred","119354"},
[74413864]={ "37391", "机械掠夺者", "i620 敏捷单手锤", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119398"},
[72401940]={ "37358", "锢魂者托雷克", "玩具+i620 法术法杖", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119410"},
[72903090]={ "37359", "虚空掠夺者乌奈", "i620 敏捷单手斧", "!!! 等级100 !!!", "hundredrare", "SoAHundred","119392"},
}
nodes["NagrandDraenor"] = {
--NagrandTreasures
[73071080]={ "35951", "一堆泥土", "要塞物资", "", "default", "NagrandTreasures","824"},
[67655971]={ "35759", "被遗弃的货箱", "随机绿装", "", "default", "NagrandTreasures",""},
[38404940]={ "36711", "阿布加尔最爱的鱼饵", "阿布加尔最爱的鱼饵", "结合阿布加尔的其他部份以获得追随者", "default", "NagrandTreasures","114245"},
[85403870]={ "36711", "阿布加尔丢失的线轮", "阿布加尔最好的线轮", "结合阿布加尔的其他部份以获得追随者", "default", "NagrandTreasures","114243"},
[65906120]={ "36711", "阿布加尔的活力", "阿布加尔的活力", "结合阿布加尔的其他部份以获得追随者", "default", "NagrandTreasures","114242"},
[75816203]={ "36077", "冒险者的钉锤", "随机绿装锤子", "", "default", "NagrandTreasures",""},
[82275660]={ "35765", "冒险者的包裹", "随机绿装", "", "default", "NagrandTreasures",""},
[45635200]={ "35969", "冒险者的包裹", "随机绿装", "", "default", "NagrandTreasures",""},
[69955244]={ "35597", "冒险者的包裹", "随机绿装", "", "default", "NagrandTreasures",""},
[56567294]={ "36050", "冒险者的钱袋", "要塞物资", "在悬崖边下面; 你需要从顶部下落到那里", "default", "NagrandTreasures","824"},
[73931405]={ "35955", "冒险者的袋子", "随机绿装", "", "default", "NagrandTreasures",""},
[81461307]={ "35953", "冒险者的法杖", "i593 法术法杖", "", "default", "NagrandTreasures","116640"},
[73057554]={ "35673", "偷来的战歌补给品", "要塞物资", "", "default", "NagrandTreasures","824"},
[62546708]={ "36116", "一袋草药", "草药", "", "default", "NagrandTreasures","109124"},
[77312807]={ "35986", "骨质匕首", "i597 敏捷匕首", "", "default", "NagrandTreasures","116760"},
[77081662]={ "36174", "元素的宝藏", "要塞物资", "使用元素石来取得", "default", "NagrandTreasures","824"},
[81083725]={ "35661", "闪亮的梦境花瓣", "回魔药水", "乘探险家伦佐的滑翔翼到那里 [这里的东北方]", "default", "NagrandTreasures","118262"},
[85415347]={ "35696", "火刃宝箱", "随机绿装", "", "default", "NagrandTreasures","824"},
[66961949]={ "35954", "元素祭品", "垃圾物品", "", "default", "NagrandTreasures","118234"},
[78901556]={ "36036", "元素镣铐", "i605 敏捷戒指", "", "default", "NagrandTreasures","118251"},
[53407320]={ "900003", "探险家比斯伯", "无 - 需要 2 财宝 在南边", "您需要使用火箭到他那边 [他位置的东南方]", "glider", "NagrandTreasures",""},
[67601420]={ "900004", "探险家德兹", "无 - 需要 2 财宝 [1 东南, 1 西南]", "你能联系到他在元素高原东边开始的地方", "glider", "NagrandTreasures",""},
[87204100]={ "900005", "探险家加里克斯", "无", "需要 2 财宝 [1 南方, 1 东南]", "glider", "NagrandTreasures",""},
[75606460]={ "900006", "探险家拉祖克", "无", "需要 3 财宝 [1 北, 1 东, 1 南]", "glider", "NagrandTreasures",""},
[83803380]={ "900007", "探险家伦佐", "无", "需要 3 财宝 [2 东北, 1 西南]", "glider", "NagrandTreasures",""},
[45866629]={ "36020", "沃舒古碎片", "i607 智力盾", "", "default", "NagrandTreasures","117981"},
[73052153]={ "35692", "淡水蛤蜊", "垃圾物品", "", "default", "NagrandTreasures","118233"},
[88901824]={ "35660", "长满真菌的宝箱", "要塞物资", "乘探险家伦佐的滑翔翼到那里 [这里的西南方]", "default", "NagrandTreasures","824"},
[75374711]={ "36074", "赌徒的钱袋", "趣味物品", "", "default", "NagrandTreasures","118236"},
[43225755]={ "35987", "吉尼达尔残骸", "要塞物资", "", "default", "NagrandTreasures","824"},
[48066011]={ "35999", "吉尼达尔残骸", "要塞物资", "", "default", "NagrandTreasures","824"},
[48587279]={ "36008", "吉尼达尔残骸", "要塞物资", "", "default", "NagrandTreasures","824"},
[44696757]={ "36002", "吉尼达尔残骸", "要塞物资", "", "default", "NagrandTreasures","824"},
[55356828]={ "36011", "吉尼达尔残骸", "要塞物资", "", "default", "NagrandTreasures","824"},
[72976212]={ "35590", "地精包裹", "要塞物资", "乘探险家拉祖克的滑翔翼到那里 [这里的东南方]", "default", "NagrandTreasures","824"},
[47207425]={ "35576", "地精包裹", "要塞物资", "乘探险家比斯伯的滑翔翼到那里 [这里的东方]", "default", "NagrandTreasures","824"},
[58285249]={ "35694", "金色卡利鸟蛋", "垃圾物品", "在树上的鸟巢里", "default", "NagrandTreasures","118266"},
[38345872]={ "36109", "金趾的战利品", "金钱", "钥匙在鹦鹉上", "default", "NagrandTreasures",""},
[87107288]={ "36051", "灰喉的骨头堆", "宠物 玩具", "", "default", "NagrandTreasures","118054"},
[87624498]={ "35622", "藏匿物", "要塞物资", "乘探险家加里克斯的滑翔翼到那里 [这里的北方]", "default", "NagrandTreasures","824"},
[67384906]={ "36039", "悬槌大锤", "i605 力量戒指", "", "default", "NagrandTreasures","118252"},
[75236563]={ "36099", "重要的探索补给", "酒精饮料", "", "default", "NagrandTreasures","61986"},
[61765747]={ "36082", "遗失的吊坠", "i593 随机绿装项链", "", "default", "NagrandTreasures","116687"},
[70531385]={ "35643", "登山者的包裹", "要塞物资", "乘探险家德兹的滑翔翼到那里 [这里的西方]", "default", "NagrandTreasures","824"},
[80967979]={ "36049", "食人魔念珠", "i605 力量戒指", "", "default", "NagrandTreasures","118255"},
[57796205]={ "36115", "白鬼药剂", "回魔药水", "", "default", "NagrandTreasures","118278"},
[58295931]={ "36021", "波卡尔的第十三把斧子", "i605 力量单手斧", "", "default", "NagrandTreasures","116688"},
[72716092]={ "36035", "抛光的刃牙虎人颅骨", "i605 敏捷/力量戒指", "", "default", "NagrandTreasures","118254"},
[58507630]={ "900008", "地精火箭", "无", "使用火箭到探险家比斯伯那里", "rocket", "NagrandTreasures",""},
[75186494]={ "36102", "刃牙虎人储物箱", "金钱", "", "default", "NagrandTreasures",""},
[89073313]={ "36857", "走私者的箱子", "要塞物资", "", "default", "NagrandTreasures","824"},
[40346864]={ "37435", "幽灵宝箱", "要塞物资", "", "default", "NagrandTreasures","824"},
[50128228]={ "35577", "热砂补给品", "要塞物资", "乘探险家比斯伯的滑翔翼到那里 [这里的东北方]", "default", "NagrandTreasures","824"},
[52678008]={ "35583", "热砂补给品", "要塞物资", "乘探险家比斯伯的滑翔翼到那里 [这里的北方]", "default", "NagrandTreasures","824"},
[77835195]={ "35591", "热砂补给品", "要塞物资", "乘探险家拉祖克的滑翔翼到那里 [这里的南方]", "default", "NagrandTreasures","824"},
[64591762]={ "35648", "热砂补给品", "要塞物资", "乘探险家德兹的滑翔翼到那里 [这里的东北方]", "default", "NagrandTreasures","824"},
[70601860]={ "35646", "热砂补给品", "要塞物资", "乘探险家德兹的滑翔翼到那里 [这里的西北方]", "default", "NagrandTreasures","824"},
[87602028]={ "35662", "热砂补给品", "要塞物资", "乘探险家伦佐的滑翔翼到那里 [这里的西南方]", "default", "NagrandTreasures","824"},
[88274262]={ "35616", "热砂补给品", "要塞物资", "乘探险家加里克斯的滑翔翼到那里 [这里的西北方]", "default", "NagrandTreasures","824"},
[64716583]={ "36046", "塔拉防御护盾", "i605 敏捷/智力戒指", "", "default", "NagrandTreasures","118253"},
[37717065]={ "34760", "库尔克罗什的宝藏", "要塞物资", "", "default", "NagrandTreasures","824"},
[49976651]={ "35579", "注灵水晶", "i613 力量双手剑", "", "default", "NagrandTreasures","118264"},
[51726029]={ "35695", "战歌宝箱", "要塞物资", "", "default", "NagrandTreasures","824"},
[52414438]={ "36073", "战歌头盔", "i609 敏捷/智力锁甲头盔", "", "default", "NagrandTreasures","118250"},
[73047036]={ "35678", "战歌保险箱", "要塞物资", "", "default", "NagrandTreasures","824"},
[76066990]={ "35682", "战歌长矛", "垃圾物品", "乘探险家拉祖克的滑翔翼到那里 [这里的北方]", "default", "NagrandTreasures","118678"},
[80656054]={ "35593", "战歌战利品", "要塞物资", "乘探险家拉祖克的滑翔翼到那里 [这里的西方]", "default", "NagrandTreasures","824"},
[89406588]={ "35976", "战歌补给品", "要塞物资", "", "default", "NagrandTreasures","824"},
[64763573]={ "36071", "防水袋", "20格包", "", "default", "NagrandTreasures","118235"},
[53386425]={ "36088", "冒险者的袋子", "随机绿装", "在洞里; 入口在东面", "default", "NagrandTreasures","824"},
[35475725]={ "36846", "幽灵的礼物", "要塞资源", "", "default", "NagrandTreasures","824"},
--NagrandRares
[84605340]={ "35778", "先祖剑圣", "i598 力量项链", "", "rare", "NagrandRares","116832"},
[51001600]={ "37210", "奥盖克松", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118654"},
[62601680]={ "37211", "伯格鲁", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118655"},
[77006400]={ "35735", "狂暴T-300系列II型", "要塞物资", "在一个山洞内, 使用一个开关开启", "rare", "NagrandRares","824"},
[39501330]={ "37396", "碎骨者", "i620 敏捷/智力 锁甲腿", "", "hundredrare", "NagrandHundred","119370"},
[43003640]={ "37400", "布塔格·利刃", "i620 智力/力量板甲鞋", "!!! 等级100 !!!", "hundredrare", "NagrandHundred","119380"},
[34607700]={ "34727", "铁须队长", "玩具+i607 枪", "", "rare", "NagrandRares","118244"},
[64203000]={ "37221", "德考汉", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118656"},
[60003800]={ "37222", "恐蹄", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118657"},
[38602240]={ "37395", "杜戈·碎脊", "i620 敏捷双手锤", "", "hundredrare", "NagrandHundred","119405"},
[89004120]={ "35623", "探险家诺赞德 ", "垃圾物品", "", "rare", "NagrandRares","118679"},
[74801180]={ "35836", "锯齿", "垃圾物品", "", "rare", "NagrandRares","116836"},
[70004180]={ "35893", "燧皮", "i609 力量盾", "", "rare", "NagrandRares","116807"},
[48202220]={ "37223", "野蛮的伽罗格", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118658"},
[52205580]={ "35715", "加鲁尔", "i605 饰品 溅射+狼触发", "", "rare", "NagrandRares","118246"},
[42207860]={ "34725", "加兹奥达", "i602 智力戒指", "在洞穴内", "rare", "NagrandRares","116798"},
[66605660]={ "35717", "狂暴的瘤蹄", "i598 饰品 溅射+敏捷触发", "", "rare", "NagrandRares","116824"},
[93202820]={ "35898", "血花", "i602 敏捷/智力 皮甲手套", "这手套可以让你在德拉诺采草快点", "rare", "NagrandRares","116916"},
[42003680]={ "37472", "高塔格·钢握", "埃匹希斯水晶", "使用秘密接头详情后从传信号角物品召唤", "hundredrare", "NagrandHundred","824"},
[84603660]={ "36159", "砂齿", "i609 敏捷/智力 皮甲手腕", "", "rare", "NagrandRares","118689"},
[66805120]={ "35714", "巨羽", "i600 布甲胸", "", "rare", "NagrandRares","116795"},
[86007160]={ "35784", "灰喉", "i610 力量披风", "", "rare", "NagrandRares","118687"},
[80603040]={ "35923", "猎手黑齿", "i609 敏捷双手锤", "", "rare", "NagrandRares","118245"},
[87005500]={ "34862", "亥伯里奥斯", "i597 饰品 急速+精通触发", "", "rare", "NagrandRares","116799"},
[45803480]={ "37399", "卡洛什·黑风", "i620 布甲腿", "", "hundredrare", "NagrandHundred","119355"},
[43803440]={ "37473", "卡拉尔·死眼", "埃匹希斯水晶", "使用秘密接头详情后从传信号角物品召唤", "hundredrare", "NagrandHundred",""},
[58201200]={ "37398", "开膛者克鲁德", "i620 智力/力量 板甲腰带+成就", "在他旁边杀死15个小怪会使其可被攻击", "hundredrare", "NagrandHundred","119384"},
[52009000]={ "37408", "莱纳亚", "未知", "", "hundredrare", "NagrandHundred",""},
[81206000]={ "35932", "马尔洛克·裂石", "i597 敏捷法杖", "", "rare", "NagrandRares","116796"},
[45801520]={ "36229", "老钳子先生", "i616 饰品 溅射+龙虾人触发", "", "rare", "NagrandRares","118690"},
[34005100]={ "37224", "穆格拉", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118659"},
[47607080]={ "35865", "灵魔", "宠物", "", "rare", "NagrandRares","116815"},
[42804920]={ "35875", "奥菲斯", "i602 布甲腿", "", "rare", "NagrandRares","116765"},
[61806900]={ "35943", "侦察骑兵杜莉萨", "i598 敏捷/智力 皮甲鞋", "", "rare", "NagrandRares","116800"},
[58201800]={ "37637", "竞技场野兽", "i620 敏捷/力量 坦克披风", "", "hundredrare", "NagrandHundred","120317"},
[39701440]={ "37397", "角斗场屠杀者", "i620 力量戒指", "", "hundredrare", "NagrandHundred","119389"},
[73605780]={ "35712", "狂野的赤爪", "i604 智力拳套", "", "rare", "NagrandRares","118243"},
[58008400]={ "35900", "鲁克拉", "i608 智力/力量 板甲肩", "", "rare", "NagrandRares","118688"},
[54806120]={ "35931", "斥候波卡尔", "i601 力量单手斧", "", "rare", "NagrandRares","116797"},
[60934775]={ "35912", "西恩·怀特斯", "i600 敏捷/智力 皮甲腰带", "当遗弃的箱子刷新时可拾取", "rare", "NagrandRares","116834"},
[75606500]={ "36128", "灵牙", "i597 智力剑", "", "rare", "NagrandRares","116806"},
[58403580]={ "37225", "泰克塔伦", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118660"},
[65003900]={ "35920", "图拉卡", "i609 敏捷披风", "", "rare", "NagrandRares","116814"},
[37003800]={ "37520", "邪爪", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","120172"},
[82607620]={ "34645", "战争大师布格索尔", "i600 力量/智力 板甲手腕", "", "rare", "NagrandRares","116805"},
[70602940]={ "35877", "唤风者科拉斯特", "i598 法术法杖", "", "rare", "NagrandRares","116808"},
[41004400]={ "37226", "艾克加纳克", "热砂保护协会的声望物品", "", "swprare", "NagrandSWP","118661"},
[26203420]={ "40075", "鲁克都格", "宠物", "", "hundredrare", "NagrandRares","129216"},
[23803790]={ "40074", "甘克", "宠物", "", "hundredrare", "NagrandRares","129218"},
[28503030]={ "40073", "普格", "宠物", "", "hundredrare", "NagrandRares","129217"},
}
nodes["TanaanJungle"] = {
[15005440]={ "38754", "哀狼之斧", "i650 力量双手斧", "东北塔第一层", "default", "TanaanTreasures","127325"},
[15905930]={ "38757", "格兰诺克之眼", "i650 智力/急速/溅射 饰品", "东南塔第二层", "default", "TanaanTreasures","128220"},
[17305690]={ "38755", "战争横财", "250 要塞物资", "", "default", "TanaanTreasures","824"},
[17005300]={ "38283", "失窃的船长宝箱", "少量金钱", "", "default", "TanaanTreasures",""},
[15904980]={ "38208", "风化的斧子", "i650 敏捷单手斧", "魔荚人洞穴内", "default", "TanaanTreasures","127324"},
[25305020]={ "38735", "“借来”的魔法望远镜", "i650 智力/暴击 饰品", "位于东塔顶层", "default", "TanaanTreasures","128222"},
[22004780]={ "38678", "血环战场储物箱", "100 要塞物资", ".", "default", "TanaanTreasures","824"},
[26804410]={ "38683", "抢来的血环宝藏", "变形物品", "塔纳安任务线#3完成后解锁", "default", "TanaanTreasures","127709"},
[19304090]={ "38320", "卡纳克之刃", "i650 敏捷单手剑", "水下", "default", "TanaanTreasures","127338"},
[31403110]={ "38732", "鸦人嵌宝雕像", "德拉诺之王宝石", "从岩石上跳过去", "default", "TanaanTreasures","127413"},
[28803460]={ "38863", "挖过的埃匹希斯水晶", "埃匹希斯水晶", "洞穴入口在 29.2 / 31.1", "default", "TanaanTreasures","823"},
[34703460]={ "38742", "疯狂酋长之颅", "缓速降落/水上行走物品", "洞穴入口在 32.5 / 37.4", "default", "TanaanTreasures","127669"},
[26506300]={ "38741", "抢来的血环宝藏", "埃匹希斯水晶和要塞物资", "在塔顶端", "default", "TanaanTreasures","823"},
[32407040]={ "38426", "隐秘之书", "玩具", "", "default", "TanaanTreasures","127670"},
[30407200]={ "38629", "抛光水晶", "德拉诺之王宝石", "", "default", "TanaanTreasures","127390"},
[37004620]={ "38640", "反白鬼设备", "要塞物资", "", "default", "TanaanTreasures","824"},
[36304350]={ "37956", "古怪的蓝宝石", "i650 耐力/护甲饰品", "", "default", "TanaanTreasures","127397"},
[43203830]={ "38821", "指挥官的盾牌", "i650 力量/智力盾", "", "default", "TanaanTreasures","127348"},
[42803540]={ "38822", "炫目之杖", "玩具", "位于东北塔顶层", "default", "TanaanTreasures","127859"},
[46904210]={ "38776", "献祭之刃", "i650 法强匕首", "", "default", "TanaanTreasures","127328"},
[46904440]={ "38773", "被邪能侵蚀的背包", "头部装饰品（护目镜）", "", "default", "TanaanTreasures","128218"},
[46903660]={ "38771", "茨兹克的书", "i650 法系副手", "", "default", "TanaanTreasures","127347"},
[50806490]={ "38731", "巨型遗物", "i650 敏捷/力量戒指", "", "default", "TanaanTreasures","127412"},
[54806930]={ "38593", "倒伏的狩猎长矛", "i650 敏捷长柄", "", "default", "TanaanTreasures","127334"},
[47907040]={ "38705", "晶化元素精华", "i650 法系拳套", "", "default", "TanaanTreasures","127329"},
[57006500]={ "38591", "被遗忘的袋子", "趣味物品+兽皮", "", "default", "TanaanTreasures","110609"},
[46207280]={ "38739", "神秘的腐化方尖碑", "附属品", "塔纳安任务线#5完成后解锁", "default", "TanaanTreasures","128320"},
[41607330]={ "38657", "被遗忘的勇士之剑", "i650 力量双手剑", "", "default", "TanaanTreasures","127339"},
[40807550]={ "38639", "完美之花", "玩具", "从旁边的神秘水果获取免疫的增益防止拾取被打断。", "default", "TanaanTreasures","127766"},
[40607980]={ "38638", "驯蛇人的笛子", "i650 法系双手锤", "", "default", "TanaanTreasures","127333"},
[34407830]={ "38762", "隐藏的铁海宝藏#3", "金钱和要塞物资", "洞穴入口在 37.5 / 76.0", "default", "TanaanTreasures","824"},
[35007730]={ "38761", "隐藏的铁海宝藏#2", "金钱和要塞物资", "洞穴入口在 37.5 / 76.0", "default", "TanaanTreasures","824"},
[33907810]={ "38760", "隐藏的铁海宝藏#1", "金钱和要塞物资", "洞穴入口在 37.5 / 76.0", "default", "TanaanTreasures","824"},
[35907860]={ "38758", "铁须的宝藏", "金钱和要塞物资", "", "default", "TanaanTreasures","824"},
[37708070]={ "38788", "觉醒火盆", "复活附属品", "", "default", "TanaanTreasures","127770"},
[48507520]={ "38814", "抢来的神秘法杖", "i650 法系法杖", "洞穴入口在 44.4 / 77.5", "default", "TanaanTreasures","127337"},
[49907680]={ "38809", "血环蘑菇桶", "有副作用的食物", "洞穴入口在 44.4 / 77.5", "default", "TanaanTreasures","128223"},
[62107070]={ "38602", "晶化邪能尖刺", "i650 智力/精神饰品", "", "default", "TanaanTreasures","128217"},
[61207580]={ "38601", "黑齿岛宝箱", "要塞物资", "", "default", "TanaanTreasures","824"},
[49907960]={ "38703", "斥候的财物", "i650 敏捷披风", "洞穴顶端", "default", "TanaanTreasures","127354"},
[49908120]={ "38702", "被遗弃的头盔", "i650 敏捷/智力锁甲头盔", "在洞穴内", "default", "TanaanTreasures","127312"},
[64704280]={ "38701", "松散的土壤", "变形玩具", "", "default", "TanaanTreasures","127396"},
[51702430]={ "38686", "铭文腿骨", "i650 魔杖", "", "default", "TanaanTreasures","127341"},
[58502520]={ "38679", "坠星珠宝", "德拉诺之王宝石", "", "default", "TanaanTreasures","115524"},
[62602050]={ "38682", "苦难熏炉", "i650 力量/全能饰品", "", "default", "TanaanTreasures","127401"},
[51603270]={ "39075", "被邪能污染的埃匹希斯晶体", "埃匹希斯水晶", "挂在柱子的边缘", "default", "TanaanTreasures","823"},
[28702330]={ "38334", "地狱火珠宝", "玩具", "", "default", "TanaanTreasures","127668"},
[63402810]={ "38740", "被遗忘的秘文碎片", "宠物", "塔纳安任务线#6完成后解锁", "default", "TanaanTreasures","128309"},
[54909070]={ "39470", "亡灵宝藏", "要塞物资", "", "default", "TanaanTreasures","824"},
[65908500]={ "39469", "珠玉彩蛋", "垃圾物品", "", "default", "TanaanTreasures","128386"},
[69705600]={ "38704", "被遗忘的钢铁部落补给品", "要塞物资", "", "default", "TanaanTreasures","824"},
[73604320]={ "38779", "隐藏的血环战利品", "金钱+垃圾物品", "位于东北塔第一层", "default", "TanaanTreasures",""},

[13605680]={ "38747", "索戈尔·血拳", "i655 敏捷/智力锁甲靴子", "", "hundredrare", "TanaanHundred","127310","28347"},
[13005700]={ "38751", "钢铁训犬师", "i655 力量/智力板甲护肩", "夺取据点（西）后会出现。需要钢铁前线事件", "hundredrare", "TanaanHundred","127321","28350"},
[16005920]={ "38750", "格兰诺克", "i655 智力项链", "位于东南塔顶层。", "hundredrare", "TanaanHundred","127649","28348"},
[15005420]={ "38746", "指挥官卡格高斯", "i655 力量/智力 板甲手套", "位于东北塔顶层", "hundredrare", "TanaanHundred","127319", "28346"},
[16005720]={ "38752", "扭曲的兹里克", "i655 布甲手套", "夺取据点（西）后会出现。需要钢铁前线事件", "hundredrare", "TanaanHundred","127296","28349"},
[16804860]={ "38282", "魔荚大王瓦卡瓦姆", "i655 敏捷法杖", "", "hundredrare", "TanaanHundred","127336", "28329"},
[23605200]={ "38262", "投掷者比尔克", "i655 敏捷/智力 皮甲肩", "", "hundredrare", "TanaanHundred","127307","28351"},
[20404980]={ "38263", "追踪者罗贡德", "i655 敏捷/智力 锁甲肩", "", "hundredrare", "TanaanHundred","127314","28352"},
[19805360]={ "38736", "德里斯·瓦伊尔", "i655 枪械", "位于南塔顶层", "hundredrare", "TanaanHundred","127331","28369"},
[25504620]={ "38264", "德努尔", "i655 布甲裤子", "", "hundredrare", "TanaanHundred","127298","28354"},
[23204840]={ "38265", "嗜血的多格", "i655 布甲腰带", "在区域内击杀怪物将使其在某处出现", "hundredrare", "TanaanHundred","127301","28353"},
[22805120]={ "38266", "猎血者祖尔克", "i655 敏捷/智力 皮甲靴子", "打断血月仪式事件后会使他出现", "hundredrare", "TanaanHundred","127303","28355"},
[22205080]={ "39159", "血月残骸", "玩具", "吸空血月之后会出现。需要泽斯高事件。", "hundredrare", "TanaanHundred","127666"},
[16804340]={ "38034", "拉瑟", "i655 暴击/精通/多重 饰品", "", "hundredrare", "TanaanHundred","127661","28341"},
[20404000]={ "38028", "高阶祭司伊克赞", "变形附属品", "在营地内游荡", "hundredrare", "TanaanHundred","122117"},
[27603280]={ "37937", "该死的瓦里克斯", "i655 智力戒指", "需要5名玩家打开牢笼", "hundredrare", "TanaanHundred","127351", "28340"},
[26305420]={ "38496", "瑞格儿", "i655 敏捷长柄", "", "hundredrare", "TanaanHundred","127335","28356"},
[28605080]={ "38775", "邪钻", "i655 力量戒指", "洞穴入口在 31.3 / 53.5", "hundredrare", "TanaanHundred","127350","28372"},
[31406800]={ "38031", "塞拉卡斯", "邪能幼崽-宠物", "其实怪不掉宠物，但是任务会在就杀它之后出现", "hundredrare", "TanaanHundred","","28336"},
[27607480]={ "38030", "贾克索尔", "i655 力量/智力 板甲腰带", "洞穴入口在 29.6 / 70.6", "hundredrare", "TanaanHundred","127322","28335"},
[25807900]={ "38032", "妖女萨弗拉", "i655 布甲肩s", "洞穴入口在 29.6 / 70.6", "hundredrare", "TanaanHundred","127300","28337"},
[25407720]={ "38029", "奥兰", "i655 敏捷/智力 锁甲 Wrist", "洞穴入口在 29.6 / 70.6", "hundredrare", "TanaanHundred","127316","28334"},
[31607280]={ "38026", "小鬼领主瓦勒萨", "附属品", "", "hundredrare", "TanaanHundred","127655","28333"},
[35404680]={ "38609", "贝尔高克", "i655 力量/智力盾", "", "hundredrare", "TanaanHundred","127650","28363"},
[34004440]={ "38620", "断肠者索玛", "i655 敏捷匕首", "", "hundredrare", "TanaanHundred","127327","28362"},
[33003570]={ "38709", "高拉博什", "i655 敏捷/智力 皮甲手套", "", "hundredrare", "TanaanHundred","127304","28368"},
[37003280]={ "39045", "大块头佐格", "i655 敏捷/智力 皮甲腰带", "", "hundredrare", "TanaanHundred","127308","28723"},
[39603260]={ "39046", "港务长库拉克", "i655 敏捷/智力 锁甲胸甲", "", "hundredrare", "TanaanHundred","127309","28724"},
[42403730]={ "37953", "莫加克中士", "i655 力量/智力 板甲靴子", "", "hundredrare", "TanaanHundred","127318","28339"},
[44603760]={ "37990", "“野火”辛达尔", "i655 全能/精通/多重 饰品", "在熔炉杀掉全部辛达尔残骸之后出现", "hundredrare", "TanaanHundred","127660","28338"},
[45804700]={ "38634", "邪能工匠达莫卡", "i655 敏捷/智力 皮甲胸甲", "", "hundredrare", "TanaanHundred","127302","28726"},
[50003600]={ "38411", "执行官里洛斯", "i655 力量/智力 板甲护腕", "", "hundredrare", "TanaanHundred","127323","28380"},
[46204240]={ "38400", "高阶术士奈瑟库斯", "i655 布甲胸甲", "", "hundredrare", "TanaanHundred","127299","28343"},
[51004600]={ "38749", "指挥官奥格莫克", "i655 敏捷/智力 锁甲裤子", "在区域内巡逻", "hundredrare", "TanaanHundred","127313","28731"},
[48005720]={ "38820", "高克玛上尉", "i655 力量/智力 板甲裤子", "", "hundredrare", "TanaanHundred","127664","28730"},
[49706140]={ "38812", "鞭影", "i655 敏捷/智力 皮甲护腕", "", "hundredrare", "TanaanHundred","127665","28725"},
[52206510]={ "38726", "麦格威", "i655 力量单手锤", "", "hundredrare", "TanaanHundred","127332","28345"},
[40807000]={ "38209", "落棘", "玩具 - 烹饪用火", "", "hundredrare", "TanaanHundred","127652" ,"28330"},
[39606810]={ "38825", "堕落的科斯卡尔", "i655 力量单手剑", "洞穴入口在 42.5 / 68.9", "hundredrare", "TanaanHundred","127653","28377"},
[34307250]={ "38654", "血爪", "i655 敏捷/智力 皮甲头盔", "洞穴入口在 36.2 / 72.4", "hundredrare", "TanaanHundred","127305","28367"},
[39407380]={ "38632", "暗夜游魂", "i655 力量披风", "获得10层他的减益之后真身出现，方法为攻击他的“分身”或搜索被肢解的尸体", "hundredrare", "TanaanHundred","127355","28366"},
[41007880]={ "38628", "希利萨", "i655 敏捷/智力 锁甲手套", "", "hundredrare", "TanaanHundred","127311","28364"},
[41807380]={ "38631", "伦达克", "i655 智力披风", "", "hundredrare", "TanaanHundred","127356","28365"},
[36207970]={ "38756", "铁须船长", "玩具", "洞穴入口在 37.5 / 76.0", "hundredrare", "TanaanHundred","127659","28370"},
[34607820]={ "38764", "古鲁布洛克", "i655 力量/智力 板甲胸甲", "洞穴入口在 37.5 / 76.0. 需要打开宝箱使其出现", "hundredrare", "TanaanHundred","127317","28371"},
[51007440]={ "38696", "血环恐魔", "i655 耐力/护甲 饰品", "洞穴入口在 44.4 / 77.5", "hundredrare", "TanaanHundred","127654","28376"},
[57606720]={ "38589", "巢母艾克斯科", "i655 敏捷戒指", "", "hundredrare", "TanaanHundred","127349","28357"},
[62607200]={ "38600", "刈魂者", "i655 敏捷/智力 锁甲腰带", "", "hundredrare", "TanaanHundred","127315","28358"},
[63608110]={ "38604", "黯爪", "i655 敏捷/智力 皮甲裤子", "", "hundredrare", "TanaanHundred","127306","28359"},
[52108390]={ "38605", "冷静的克莱尔", "i655 敏捷/多重 饰品", "", "hundredrare", "TanaanHundred","127418","28360"},
[48807280]={ "38597", "黑齿", "i655 敏捷拳套", "", "hundredrare", "TanaanHundred","127330","28361"},
[48402850]={ "38207", "泽特尔", "i655 力量双手剑", "洞穴入口在 48.1 / 33.0", "hundredrare", "TanaanHundred","127340","28331"},
[52802560]={ "38211", "魔芒", "i655 布甲护腕", "", "hundredrare", "TanaanHundred","127656","28332"},
[53602170]={ "38557", "苦痛妖女塞萝拉", "i655 布甲头盔", "杀死多波怪物事件之后她会出现", "hundredrare", "TanaanHundred","127297","28342"},
[57102280]={ "38457", "普崔萨", "i655 智力/精神 饰品", "", "hundredrare", "TanaanHundred","127657","28727"},
[53002000]={ "38580", "大统领玛古斯", "i655 力量/智力 板甲头盔", "", "hundredrare", "TanaanHundred","127320","28729"},
[60202090]={ "38579", "不朽的艾萨兹", "i655 智力副手", "", "hundredrare", "TanaanHundred","127658","28728"},
[65403660]={ "38700", "钢吻", "i655 敏捷/力量披风", "", "hundredrare", "TanaanHundred","127357","28344"},
[52604020]={ "38430", "毁灭者阿格什", "i655 弩", "", "hundredrare", "TanaanHundred","127326","28722"},
[41407960]={ "37407", "科拉诺斯", "未知", "", "hundredrare", "TanaanHundred",""},
[88005550]={ "40104", "萨姆逊·强掠", "玩具", "", "hundredrare", "TanaanHundred","108634"},
[83504380]={ "40105", "达库姆", "玩具", "", "hundredrare", "TanaanHundred","108631"},
[80405680]={ "40106", "贡达", "玩具", "", "hundredrare", "TanaanHundred","108633"},
[40705630]={ "40107", "邪能监工玛德拉普", "打下坐骑物品", "", "hundredrare", "TanaanHundred","129295"},

[15406340]={ "39288", "泰罗菲斯特", "坐骑+原油", "在刷新时弗甘喊道： 一头巨型小戈隆正冲向游侠避难所！我们需要援助！", "hundredrare", "TanaanBoss",""},
[23204040]={ "39287", "死爪", "坐骑+原油", "在刷新时暗影领主艾斯卡喊道： 在彼岸，你能找到的只有死亡！", "hundredrare", "TanaanBoss",""},
[32407400]={ "39290", "维金斯", "坐骑+原油", "在刷新时暴君维哈里喊道： 爬虫只配被碾死！", "hundredrare", "TanaanBoss",""},
[47005260]={ "39289", "末日之轮", "坐骑+原油", "在刷新时攻城大师玛塔克喊道： 哈哈！狠狠践踏他们的尸体吧！", "hundredrare", "TanaanBoss",""},
}
nodes["garrisonsmvalliance_tier1"] = {
[49604380]={ "35530", "坠月鸟蛋", "要塞物资", "在一辆货车上", "default", "SMVTreasures","824"},
[42405436]={ "35381", "派普斯埋藏的补给品 1", "要塞物资", "", "default", "SMVTreasures","824"},
[50704850]={ "35382", "派普斯埋藏的补给品 2", "要塞物资", "", "default", "SMVTreasures","824"},
[30802830]={ "35383", "派普斯埋藏的补给品 3", "要塞物资", "", "default", "SMVTreasures","824"},
[49197683]={ "35384", "派普斯埋藏的补给品 4", "要塞物资", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失窃补给", "要塞物资", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 }
nodes["garrisonsmvalliance_tier2"] = {
[37306590]={ "35530", "坠月鸟蛋", "要塞物资", "在一辆货车上", "default", "SMVTreasures","824"},
[41685803]={ "35381", "派普斯埋藏的补给品 1", "要塞物资", "", "default", "SMVTreasures","824"},
[51874545]={ "35382", "派普斯埋藏的补给品 2", "要塞物资", "", "default", "SMVTreasures","824"},
[34972345]={ "35383", "派普斯埋藏的补给品 3", "要塞物资", "", "default", "SMVTreasures","824"},
[46637608]={ "35384", "派普斯埋藏的补给品 4", "要塞物资", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失窃补给", "要塞物资", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 }
nodes["garrisonsmvalliance_tier3"] = {
[61277261]={ "35530", "坠月鸟蛋", "要塞物资", "在帐篷里", "default", "SMVTreasures","824"},
[60575515]={ "35381", "派普斯埋藏的补给品 1", "要塞物资", "", "default", "SMVTreasures","824"},
[37307491]={ "35382", "派普斯埋藏的补给品 2", "要塞物资", "", "default", "SMVTreasures","824"},
[37864378]={ "35383", "派普斯埋藏的补给品 3", "要塞物资", "", "default", "SMVTreasures","824"},
[61527154]={ "35384", "派普斯埋藏的补给品 4", "要塞物资", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失窃补给", "要塞物资", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 }
nodes["garrisonffhorde_tier1"] = {
[74505620]={ "34937", "塞娜小姐的备用物资", "要塞物资", "", "default", "FFRTreasures","824"},
}
nodes["garrisonffhorde_tier2"] = {
[74505620]={ "34937", "塞娜小姐的备用物资", "要塞物资", "", "default", "FFRTreasures","824"},
}
nodes["garrisonffhorde_tier3"] = {
[74505620]={ "34937", "塞娜小姐的备用物资", "要塞物资", "", "default", "FFRTreasures","824"},
}

if (PlayerFaction == "Alliance") then
nodes["ShadowmoonValleyDR"][29600620]={ "35281", "巴哈麦", "熔火鱿鱼", "", "rare", "SMVRares","111666"}
nodes["Gorgrond"][60805400]={ "36502", "拜奥兰特", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","116159"}
nodes["Gorgrond"][46004680]={ "35816", "查尔·恐翼", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113457"}
nodes["Gorgrond"][42805920]={ "35812", "火山领主伊格尼斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113449"}
nodes["Gorgrond"][40505100]={ "35809", "“死水”德斯克斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113446"}
nodes["Gorgrond"][51804160]={ "35808", "暴虐的艾罗萨恩", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113445"}
nodes["Gorgrond"][58006360]={ "35813", "真菌守卫者", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113453"}
nodes["ShadowmoonValleyDR"][21603300]={ "33664", "咕噜姆", "i516 敏捷/智力 戒指", "", "rare", "SMVRares","113082"}
nodes["Gorgrond"][52406580]={ "35820", "吞噬者卡加克斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113461"}
nodes["ShadowmoonValleyDR"][30301990]={ "35530", "坠月鸟蛋", "要塞物资", "在帐篷里", "default", "SMVTreasures","824"}
nodes["Gorgrond"][51206360]={ "35817", "“天空魔王”洛尔丹", "加经验值的任务物品", "会不停地飞来飞去转圈, 坐标只是在他的路线中的一处！在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113458"}
nodes["ShadowmoonValleyDR"][42804100]={ "33038", "风牙狼母", "i516 敏捷/力量 单手剑", "安波里水晶防御事件的一部分", "rare", "SMVRares","113553"}
end
if (PlayerFaction == "Horde") then
nodes["Gorgrond"][60805400]={ "36503", "拜奥兰特", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","116160"}
nodes["Gorgrond"][46004680]={ "35815", "查尔·恐翼", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113456"}
nodes["Gorgrond"][42805920]={ "35811", "火山领主伊格尼斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113448"}
nodes["Gorgrond"][40505100]={ "35810", "“死水”德斯克斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113447"}
nodes["Gorgrond"][51804160]={ "35807", "暴虐的艾罗萨恩", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113444"}
nodes["Gorgrond"][58006360]={ "35814", "真菌守卫者", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113454"}
nodes["Gorgrond"][52406580]={ "35819", "吞噬者卡加克斯", "加经验值的任务物品", "在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113460"}
nodes["Talador"][61107170]={ "34116", "诺拉纳的宝箱", "i564 敏捷项链", "", "default", "TaladorTreasures","117563"}
nodes["Gorgrond"][51206360]={ "35818", "“天空魔王”洛尔丹", "加经验值的任务物品", "会不停地飞来飞去转圈, 坐标只是在他的路线中的一处！在这个元素从地图去除前，您必须完成任务", "rare", "GorgrondRares","113459"}
end

local function GetItem(ID)
	if (ID == "824" or ID == "823") then
		local currency, _, _ = GetCurrencyInfo(ID)
		if (currency ~= nil) then
			return currency
		else
			return "货币 ID 载入错误"
		end
	else
		local _, item, _, _, _, _, _, _, _, _ = GetItemInfo(ID)
		if (item ~= nil) then
			return item
		else
			return "物品 ID 载入错误"
		end
	end
end	
local function GetIcon(ID)
	if (ID == "824" or ID == "823") then
		local _, _, icon = GetCurrencyInfo(ID)
		if (icon ~= nil) then
			return icon
		else
			return "Interface\\Icons\\inv_misc_questionmark"
		end
	else
		local _, _, _, _, _, _, _, _, _, icon = GetItemInfo(ID)
		if (icon ~= nil) then
			return icon
		else
			return "Interface\\Icons\\inv_misc_questionmark"
		end
	end
end	
function DraenorTreasures:OnEnter(mapFile, coord)
    if (not nodes[mapFile][coord]) then return end
	
	local tooltip = self:GetParent() == WorldMapButton and WorldMapTooltip or GameTooltip
	if ( self:GetCenter() > UIParent:GetCenter() ) then
		tooltip:SetOwner(self, "ANCHOR_LEFT")
	else
		tooltip:SetOwner(self, "ANCHOR_RIGHT")
	end
	tooltip:SetText(nodes[mapFile][coord][2])
	if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
		if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
			tooltip:AddLine(("掉落: " .. GetItem(nodes[mapFile][coord][7])), nil, nil, nil, true)
			if ((nodes[mapFile][coord][3] ~= nil) and (nodes[mapFile][coord][3] ~= "")) then
			tooltip:AddLine(("掉落信息: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
			end
		else
			tooltip:AddLine(("掉落: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
		end
		
	end
	if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
	 tooltip:AddLine(("注释: " .. nodes[mapFile][coord][4]), nil, nil, nil, true)
	end
	tooltip:Show()
end

local isMoving = false
local info = {}
local clickedMapFile = nil
local clickedCoord = nil
local function generateMenu(button, level)
	if (not level) then return end
	for k in pairs(info) do info[k] = nil end
	if (level == 1) then
	
		info.isTitle      = 1
		info.text         = "DraenorTreasures"
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)
		
		info.disabled     = nil
		info.isTitle      = nil
		info.notCheckable = nil
		info.text = "从地图上移除此物件"
		info.func = DisableTreasure
		info.arg1 = clickedMapFile
		info.arg2 = clickedCoord
		UIDropDownMenu_AddButton(info, level)
		
		if isTomTomloaded == true then
			info.text = "在 TomTom 添加此路径点位置"
			info.func = addtoTomTom
			info.arg1 = clickedMapFile
			info.arg2 = clickedCoord
			UIDropDownMenu_AddButton(info, level)
		end
		if isDBMloaded == true then
			info.text = "在 DBM 中添加此财宝箭头"
			info.func = AddDBMArrow
			info.arg1 = clickedMapFile
			info.arg2 = clickedCoord
			UIDropDownMenu_AddButton(info, level)
			
			info.text = "隐藏 DBM 箭头"
			info.func = HideDBMArrow
			UIDropDownMenu_AddButton(info, level)
		end

		info.text         = CLOSE
		info.func         = function() CloseDropDownMenus() end
		info.arg1         = nil
		info.arg2         = nil
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)

		info.text         = "恢复已移除物件"
		info.func         = ResetDB
		info.arg1         = nil
		info.arg2         = nil
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)
		
		end
	end
local HandyNotes_DraenorTreasuresDropdownMenu = CreateFrame("Frame", "HandyNotes_DraenorTreasuresDropdownMenu")
HandyNotes_DraenorTreasuresDropdownMenu.displayMode = "MENU"
HandyNotes_DraenorTreasuresDropdownMenu.initialize = generateMenu

function DraenorTreasures:OnClick(button, down, mapFile, coord)
		if button == "RightButton" and down then
			clickedMapFile = mapFile
			clickedCoord = coord
			ToggleDropDownMenu(1, nil, HandyNotes_DraenorTreasuresDropdownMenu, self, 0, 0)
		end
	end

function DraenorTreasures:OnLeave(mapFile, coord)
	if self:GetParent() == WorldMapButton then
		WorldMapTooltip:Hide()
	else
		GameTooltip:Hide()
	end
end

local options = {
 type = "group",
 name = "德拉诺财宝",
 desc = "德拉诺财宝位置。",
get = function(info) return DraenorTreasures.db.profile[info.arg] end,
set = function(info, v) DraenorTreasures.db.profile[info.arg] = v; DraenorTreasures:Refresh() end,
 args = {
   desc = {
   name = "一般设定",
   type = "description",
   order = 0,
  },
   icon_scale_treasures = {
   type = "range",
   name = "财宝图标大小",
   desc = "图标的大小",
   min = 0.25, max = 3, step = 0.01,
   arg = "icon_scale_treasures",
   order = 1,
  },
  icon_scale_rares = {
   type = "range",
   name = "稀有图标大小",
   desc = "图标的大小",
   min = 0.25, max = 3, step = 0.01,
   arg = "icon_scale_rares",
   order = 2,
  },
  icon_alpha = {
   type = "range",
   name = "图标透明度",
   desc = "图标的透明度",
   min = 0, max = 1, step = 0.01,
   arg = "icon_alpha",
   order = 20,
  },

  VisibilityOptions = {
  type = "group",
  name = "可见性设定",
  desc = "可见性设定",
  args = {


VisibilityGroup = {
	type = "group",
	order = 0,
	name = "选择哪些区域要显示什么:",
	inline = true,
	args = {
SMVGroup = {
	name = "影月谷",
	desc = "Shadowmoon Valley",
	type = "header",
	order = 0,
	},
SMVTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "SMVTreasures",
   order = 1,
   width = "half",
  },
SMVRares = {
   type = "toggle",
   name = "稀有",
   arg = "SMVRares",
   order = 2,
   width = "half",
  },
SMVHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   desc = "等级100稀有出现地点",
   arg = "SMVHundred",
   order = 3,
   width = "half",
  },
FFRGroup = {
	name = "霜火岭",
	desc = "霜火岭",
	type = "header",
	order = 10,
	},	
FFRTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "FFRTreasures",
   width = "half",
   order = 11,
  },
FFRBF = {
   type = "toggle",
   name = "刀塔",
   desc = "刀塔堡垒财宝",
   arg = "FFRBF",
   width = "half",
   order = 12,
  },
FFRRares = {
   type = "toggle",
   name = "稀有",
   arg = "FFRRares",
   width = "half",
   order = 13,
  },
FFRHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   desc = "等级100稀有出现地点",
   arg = "FFRHundred",
   width = "half",
   order = 14,
  },
GorgrondGroup = {
	name = "戈尔隆德",
	desc = "戈尔隆德",
	type = "header",
	order = 20,
	},	
GorgrondTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "GorgrondTreasures",
   width = "half",
   order = 21,
  },
GorgrondRares = {
   type = "toggle",
   name = "稀有",
   arg = "GorgrondRares",
   width = "half",
   order = 22,
  },  
GorgrondHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   arg = "GorgrondHundred",
   desc = "等级100稀有出现地点",
   width = "normal",
   order = 23,
  },  
GorgrondLumber = {
   type = "toggle",
   name = "伐木场财宝",
   arg = "GorgrondLumber",
   desc = "伐木场财宝",
   width = "normal",
   order = 24,
  },  
GorgrondBoulder = {
   type = "toggle",
   name = "格斗竞技场财宝",
   arg = "GorgrondBoulder",
   desc = "格斗竞技场财宝",
   width = "normal",
   order = 25,
  },  
TaladorGroup = {
	name = "塔拉多",
	desc = "塔拉多",
	type = "header",
	order = 30,
	},	
TaladorTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "TaladorTreasures",
   width = "half",
   order = 31,
  },
TaladorRares = {
   type = "toggle",
   name = "稀有",
   arg = "TaladorRares",
   width = "half",
   order = 32,
  },  
TaladorHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   arg = "TaladorHundred",
   desc = "等级100 稀有出现地点",
   width = "normal",
   order = 33,
  },  
SoAGroup = {
	name = "阿兰卡峰林",
	desc = "阿兰卡峰林",
	type = "header",
	order = 40,
	},	  
SoATreasures = {
   type = "toggle",
   name = "财宝",
   arg = "SoATreasures",
   width = "half",
   order = 41,
  },
SoARares = {
   type = "toggle",
   name = "稀有",
   arg = "SoARares",
   width = "half",
   order = 42,
  },  
SoAHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   desc = "等级100稀有出现地点",
   arg = "SoAHundred",
   width = "half",
   order = 43,
  },
SoAArchaeology = {
   type = "toggle",
   name = "阿兰卡峰林考古",
   desc = "考古财宝",
   arg = "SoAArchaeology",
   width = "half",
   order = 44,
},  
NagrandGroup = {
	name = "纳格兰",
	desc = "纳格兰",
	type = "header",
	order = 50,
	},	    
  NagrandTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "NagrandTreasures",
   width = "half",
   order = 51,
  },
  NagrandRares = {
   type = "toggle",
   name = "稀有",
   arg = "NagrandRares",
   width = "half",
   order = 52,
  },
  NagrandHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   arg = "NagrandHundred",
   desc = "等级100稀有出现地点",
   width = "half",
   order = 53,
  },
  NagrandSWPRares = {
   type = "toggle",
   name = "热砂保护协会稀有",
   desc = "热砂保护协会稀有",
   arg = "NagrandSWP",
   width = "half",
   order = 54,
  },
 TanaanGroup = {
	name = "塔纳安丛林",
	desc = "塔纳安丛林",
	type = "header",
	order = 55,
	},	
TanaanHundredRares = {
   type = "toggle",
   name = "100等级稀有",
   arg = "TanaanHundred",
   desc = "等级100稀有出现地点",
   width = "normal",
   order = 56,
  },
TanaanHundredAchievement = {
   type = "toggle",
   name = "只显示成就所缺失的项 [丛林捕猎者]",
   arg = "TanaanHundredAchievement",
   desc = "这里有优先级选项 [总是显示已拾取的稀有]",
   width = "normal",
   order = 57,
  },
TanaanTreasures = {
   type = "toggle",
   name = "财宝",
   arg = "TanaanTreasures",
   desc = "等级100稀有出现地点",
   width = "normal",
   order = 59,
  },    
TanaanBoss = {
   type = "toggle",
   name = "首领",
   arg = "TanaanBoss",
   desc = "坐骑和原油首领",
   width = "normal",
   order = 58,
  },   
	},
  },
  alwaysshowrares = {
   type = "toggle",
   name = "仍然显示已经拾取(击杀)的财宝(稀有)",
   desc = "显示每个财宝/稀有不论拾取状态",
   arg = "alwaysshow",
   order = 100,
   width = "full",
  },
  alwaysshowtreasures = {
   type = "toggle",
   name = "总是显示已拾取的稀有",
   desc = "显示每个宝物无论是否已拾取状态",
   arg = "alwaysshowtreasures",
   order = 101,
   width = "full",
  },
    show_loot = {
   type = "toggle",
   name = "显示掉落",
   desc = "显示每个财宝/稀有的掉落",
   arg = "show_loot",
   order = 102,
   },
  show_notes = {
   type = "toggle",
   name = "显示注释",
   desc = "显示每个财宝/稀有的注释如果可用的话",
   arg = "show_notes",
   order = 103,
   },
	 },
	},
  },
}

function DraenorTreasures:OnInitialize()
 local defaults = {
  profile = {
   icon_scale_treasures = 1.5,
   icon_scale_rares = 2.0,
   icon_alpha = 1.00,
   alwaysshowrares = false,
   alwaysshowtreasures = false,
   save = true,
   SMVTreasures = true,
   SMVRares = true,
   SMVHundred = true,
   FFRTreasures = true,
   FFRRares = true,
   FFRHundred = true,
   FFRBF = false,
   GorgrondTreasures = true,
   GorgrondRares = true,
   GorgrondHundred = true,
   GorgrondLumber = true,
   GorgrondBoulder = true,
   TaladorTreasures = true,
   TaladorRares = true,
   TaladorHundred = true,
   SoATreasures = true,
   SoARares = true,
   SoAHundred = true,
   SoAArchaeology = true,
   NagrandTreasures = true,
   NagrandRares = true,
   NagrandHundred = true,
   NagrandSWP = true,
   TanaanHundred = true,
   TanaanHundredAchievement = false,
   TanaanBoss = true,
   TanaanTreasures = true,
   show_loot = true,
   show_notes = true,
   },
 }

 self.db = LibStub("AceDB-3.0"):New("DraenorTreasuresDB", defaults, "Default")
 self:RegisterEvent("PLAYER_ENTERING_WORLD", "WorldEnter")
end

function DraenorTreasures:WorldEnter()
 self:UnregisterEvent("PLAYER_ENTERING_WORLD")
 self:ScheduleTimer("QuestCheck", 5)
 self:ScheduleTimer("RegisterWithHandyNotes", 8)
end

function DraenorTreasures:QuestCheck()
do
	if ((IsQuestFlaggedCompleted(36386) == false) or (IsQuestFlaggedCompleted(36390) == false) or (IsQuestFlaggedCompleted(36389) == false) or (IsQuestFlaggedCompleted(36392) == false) or (IsQuestFlaggedCompleted(36388) == false) or (IsQuestFlaggedCompleted(36381) == false)) then
nodes["SpiresOfArak"][43901500]={ "36395", "暗影视觉药剂 1", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
nodes["SpiresOfArak"][43802470]={ "36397", "暗影视觉药剂 2", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
nodes["SpiresOfArak"][69204330]={ "36398", "暗影视觉药剂 3", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
nodes["SpiresOfArak"][48906250]={ "36399", "暗影视觉药剂 4", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
nodes["SpiresOfArak"][55602200]={ "36400", "暗影视觉药剂 5", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
nodes["SpiresOfArak"][53108450]={ "36401", "暗影视觉药剂 6", "暗影视觉药剂", "药剂可以使用在泰罗卡圣物盒装等585武器6个其中之一 (参见安苏之赐) 一但您拾取所有安苏之赐后物件会立刻被删除", "default", "SoATreasures","115463"}
	end
	if (IsQuestFlaggedCompleted(36249) or IsQuestFlaggedCompleted(36250)) then
		--Gorgrond Lumber Mill is active if either of these Quest IDs are true
nodes["Gorgrond"][49074846]={ "35952", "古老的石质容器", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42345477]={ "36003", "古老的石质容器", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47514363]={ "36717", "古老的石质容器", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][53354679]={ "35701", "上古泰坦宝箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][50155376]={ "35984", "上古泰坦宝箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42084607]={ "36720", "上古泰坦宝箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][41988155]={ "35982", "木精精华之种", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][49657883]={ "35968", "被遗忘的食人魔宝箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47016905]={ "35971", "被遗忘的嘲颅文物", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45808931]={ "36019", "被遗忘的嘲颅文物", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][39335627]={ "36716", "被遗忘的嘲颅文物", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][56745727]={ "35965", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][41147726]={ "35980", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][60507276]={ "36015", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][63285719]={ "36430", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47647679]={ "36714", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51756909]={ "36715", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][40956732]={ "35979", "黑曜水晶岩", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45969357]={ "35975", "探测工程师托德卡·灰钉的遗骸", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51806148]={ "35966", "格里米尔·灰签的遗骸", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51647226]={ "35967", "未知的石化之蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45318195]={ "35981", "未知的石化之蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42914350]={ "36001", "未知的石化之蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][53007906]={ "36713", "未知的石化之蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47245180]={ "36718", "未知的石化之蛋", "", "", "default", "GorgrondLumber","824"}
	end
	if (IsQuestFlaggedCompleted(36251) or IsQuestFlaggedCompleted(36252)) then
		--Gorgrond Sparring Arena is active if either of these Quest IDs are true
nodes["Gorgrond"][45634931]={ "36722", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][43224574]={ "36723", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41764527]={ "36726", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][48115516]={ "36730", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][51334055]={ "36734", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][46056305]={ "36736", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][58125146]={ "36739", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][59567275]={ "36781", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45748821]={ "36784", "古老的石质容器", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45544298]={ "36733", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45076993]={ "36737", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][61555855]={ "36740", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][54257313]={ "36782", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42179308]={ "36787", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41528652]={ "36789", "上古食人魔文物", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][49425084]={ "36710", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42195203]={ "36727", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][43365169]={ "36731", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][47923998]={ "36735", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][50326658]={ "36738", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][49128248]={ "36783", "上古泰坦宝箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][48114638]={ "36721", "黑曜水晶岩", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41855889]={ "36728", "黑曜水晶岩", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42056429]={ "36729", "黑曜水晶岩", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][44184665]={ "36732", "黑曜水晶岩", "", "", "default", "GorgrondBoulder","824"}
	end
end
end

function DraenorTreasures:RegisterWithHandyNotes()
do
	local function iter(t, prestate)
		if not t then return nil end
		local state, value = next(t, prestate)
		while state do
				if (value[1] and self.db.profile[value[6]] and not DraenorTreasures:HasBeenLooted(value)) and (value[6] == "TanaanHundred") then
					if (self.db.profile.TanaanHundredAchievement) then
						if ((value[8] ~= nil) and (value[8] ~= "")) then
							local _, _, completed, _, _, _, _, _, _, _, _ = GetAchievementCriteriaInfoByID(10070, value[8])
							if (completed == false) then
								if ((value[7] ~= nil) and (value[7] ~= "")) then
									GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
								end
								if ((value[5] == "default") or (value[5] == "unknown")) then
									if ((value[7] ~= nil) and (value[7] ~= "")) then
										return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
									else
										return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
									end
								end
								return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha
							end
						end
					else
						if ((value[7] ~= nil) and (value[7] ~= "")) then
							GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
						end
						if ((value[5] == "default") or (value[5] == "unknown")) then
						if ((value[7] ~= nil) and (value[7] ~= "")) then
							return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						else
							return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						end
					end
					return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha	
					end
				end
			    -- QuestID[1], Name[2], Loot[3], Notes[4], Icon[5], Tag[6], ItemID[7]
			    if (value[1] and self.db.profile[value[6]] and not DraenorTreasures:HasBeenLooted(value)) and (value[6] ~= "TanaanHundred") then
					if ((value[7] ~= nil) and (value[7] ~= "")) then
				 	GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
					end
					if ((value[5] == "default") or (value[5] == "unknown")) then
						if ((value[7] ~= nil) and (value[7] ~= "")) then
							return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						else
							return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						end
					end
				 return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha
				end
			state, value = next(t, state)
		end
	end
	function DraenorTreasures:GetNodes(mapFile, isMinimapUpdate, dungeonLevel)
		return iter, nodes[mapFile], nil
	end
end

 HandyNotes:RegisterPluginDB("DraenorTreasures", self, options)
 self:RegisterBucketEvent({ "LOOT_CLOSED" }, 2, "Refresh")
 self:Refresh()
end
 
function DraenorTreasures:Refresh()
 self:SendMessage("HandyNotes_NotifyUpdate", "DraenorTreasures")
end

function ResetDB()
	table.wipe(DraenorTreasures.db.char)
	DraenorTreasures:Refresh()
end

function DraenorTreasures:HasBeenLooted(value)
if (self.db.profile.alwaysshowtreasures and (string.find(value[6], "Treasures") ~= nil)) then return false end
if (self.db.profile.alwaysshowrares and (string.find(value[6], "Treasures") == nil)) then return false end
if (DraenorTreasures.db.char[value[1]] and self.db.profile.save) then return true end
if (IsQuestFlaggedCompleted(value[1])) then
	return true
end
return false
end

function DisableTreasure(button, mapFile, coord)
	if (nodes[mapFile][coord][1] ~= nil) then
		DraenorTreasures.db.char[nodes[mapFile][coord][1]] = true;
	end
	DraenorTreasures:Refresh()
end
function addtoTomTom(button, mapFile, coord)
	if isTomTomloaded == true then
		local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
		local x, y = HandyNotes:getXY(coord)
		local desc = nodes[mapFile][coord][2];
        if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落信息：" .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
            end
        end
        if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
            desc = desc.."\n注释：" .. nodes[mapFile][coord][4]
        end
		TomTom:AddMFWaypoint(mapId, nil, x, y, {
			title = desc,
			persistent = nil,
			minimap = true,
			world = true
		})
	end
end

if isDBMloaded == true then
			local ArrowDesc = DBMArrow:CreateFontString(nil, "OVERLAY", "GameTooltipText")
			ArrowDesc:SetWidth(400)
			ArrowDesc:SetHeight(100)
			ArrowDesc:SetPoint("CENTER", DBMArrow, "CENTER", 0, -35)
			ArrowDesc:SetTextColor(1, 1, 1, 1)
			ArrowDesc:SetJustifyH("CENTER")
			DBMArrow.Desc = ArrowDesc
end

function AddDBMArrow(button, mapFile, coord)
	if isDBMloaded == true then
			local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
			local x, y = HandyNotes:getXY(coord)
			local desc = nodes[mapFile][coord][2];
			if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
				if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
					desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
					desc = desc.."\n掉落信息：" .. nodes[mapFile][coord][3];
				else
					desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
				end
			end
			if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
				desc = desc.."\n注释：" .. nodes[mapFile][coord][4]
			end
			if not DBMArrow.Desc:IsShown() then
				DBMArrow.Desc:Show()
			end
			x = x*100
			y = y*100
			DBMArrow.Desc:SetText(desc)
			DBM.Arrow:ShowRunTo(x, y, nil, nil, true)
	end
end

function HideDBMArrow()
	DBM.Arrow:Hide(true)
end